Repository: X-Sharp/XSharpPublic
Catalog: src/VsProjectSystem/src/Microsoft.VisualStudio.ProjectSystem.Managed.VS/xlf/Menus.vsct.*.xlf
Languages: cs, fr

# cmdidNavigateToProject|ButtonText
source: N&avigate to Project
cs: &Přejít na projekt
fr: A&ccéder au projet

# cmdidProjectDebugger|ButtonText
source: Web Debugger
cs: Webový ladicí program
fr: Débogueur web

# cmdidGenerateNuGetPackageProjectContextMenu|ButtonText
source: &Pack
cs: &Zabalit
fr: &Compresser

# cmdidGenerateNuGetPackageProjectContextMenu|ToolTipText
source: Generate NuGet Package
cs: Generovat balíček NuGet
fr: Générer un package NuGet

# cmdidGenerateNuGetPackageTopLevelBuild|ButtonText
source: &Pack selection
cs: &Zabalit výběr
fr: &Compresser la sélection

# cmdidGenerateNuGetPackageTopLevelBuild|ToolTipText
source: Generate NuGet Package for selected project
cs: Generovat balíček NuGet pro vybraný projekt
fr: Générer un package NuGet pour le projet sélectionné

# DebugTargetMenuDebugFrameworkMenu|ButtonText
source: Framework
cs: Architektura

# cmdidDebugFrameworks|ButtonText
source: Framework
cs: Architektura

# AddAboveMenu|ButtonText
source: &Add Above
cs: &Přidat výše
fr: &Ajouter au-dessus

# cmdidAddNewItemAbove|ButtonText
source: &Add New Item...
cs: &Přidat novou položku...
fr: &Ajouter un nouvel élément...

# AddBelowMenu|ButtonText
source: &Add Below
cs: &Přidat níže
fr: &Ajouter en dessous

# cmdidAddExistingItemAbove|ButtonText
source: &Add Existing Item...
cs: &Přidat existující položku...
fr: &Ajouter un élément existant...

# cmdidAddNewItemBelow|ButtonText
source: &Add New Item...
cs: &Přidat novou položku...
fr: &Ajouter un nouvel élément...

# cmdidAddExistingItemBelow|ButtonText
source: &Add Existing Item...
cs: &Přidat existující položku...
fr: &Ajouter un élément existant...
