Repository: X-Sharp/XSharpPublic
Catalog: src/VisualStudio/SDKProjects/src/Microsoft.VisualStudio.Editors/PropPages/xlf/AdvCompilerSettingsPropPage.*.xlf
Languages: es, ja, ko, pt_br, ru

# OptimizationsLabel.Text
source: Optimizations
es: Optimizaciones
ja: 最適化
ko: 최적화
pt_br: Otimizações
ru: Оптимизации

# RemoveIntegerChecks.Text
source: &Remove integer overflow checks
es: &Quitar comprobaciones de desbordamiento de enteros
ja: 整数オーバーフローのチェックを削除(&R)
ko: 정수 오버플로 검사 해제(&R)
pt_br: &Remover verificações de estouro de inteiro
ru: &Удалять проверки переполнения для целочисленных значений

# Optimize.Text
source: &Enable optimizations
es: &Habilitar optimizaciones
ja: 最適化を有効にする(&E)
ko: 최적화 사용(&E)
pt_br: &Habilitar otimizações
ru: Включить &оптимизации

# DllBaseLabel.Text
source: DLL &base address:
es: Dirección &base del archivo DLL:
ja: DLL ベース アドレス(&B):
ko: DLL 기준 주소(&B):
pt_br: Endereço &básico do DLL:
ru: Базовый &адрес DLL:

# DefineDebug.Text
source: Define &DEBUG constant
es: Definir constante &DEBUG
ja: DEBUG 定数の定義(&D)
ko: DEBUG 상수 정의(&D)
pt_br: Definir a constante &DEBUG
ru: Определить &константу DEBUG

# DefineTrace.Text
source: Define &TRACE constant
es: Definir constante &TRACE
ja: TRACE 定数の定義(&T)
ko: TRACE 상수 정의(&T)
pt_br: Definir a constante &TRACE
ru: Определить ко&нстанту TRACE

# GenerateSerializationAssembliesLabel.Text
source: Generate &serialization assemblies:
es: Generar ensamblados de &serialización:
ja: シリアル化アセンブリの生成(&S):
ko: Serialization 어셈블리 생성(&S):
pt_br: Gerar assemblies de &serialização:
ru: &Создать сборки сериализации:

# CustomConstantsLabel.Text
source: &Custom constants:
es: &Constantes personalizadas:
ja: カスタム定数(&C):
ko: 사용자 지정 상수(&C):
pt_br: &Constantes personalizadas:
ru: &Пользовательские константы:

# GenerateDebugInfoLabel.Text
source: &Generate debug info:
es: &Generar información de depuración:
ja: デバッグ情報の生成(&G):
ko: 디버그 정보 생성(&G):
pt_br: &Gerar informações de depuração:
ru: Создать сведения об &отладке:

# CustomConstantsExampleLabel.Text
source: Example: Name1="Value1",Name2="Value2",Name3="Value3"
es: Ejemplo: Nombre1="Valor1",Nombre2="Valor2",Nombre3="Valor3"
ja: 例:Name1="Value1",Name2="Value2",Name3="Value3"
ko: 예: Name1="Value1",Name2="Value2",Name3="Value3"
pt_br: Exemplo: Name1="Value1",Name2="Value2",Name3="Value3"
ru: Пример: Name1="значение1",Name2="значение2",Name3="значение3"

# CompilationConstantsLabel.Text
source: Compilation Constants
es: Constantes de compilación
ja: コンパイル定数
ko: 컴파일 상수
pt_br: Constantes de Compilação
ru: Константы компиляции

# CompileWithDotNetNative.Text
source: Compile with .NET Native toolchain
es: Compilar con la cadena de herramientas de .NET Native
ja: .NET ネイティブ ツールチェーンでコンパイルする
ko: .NET 네이티브 도구 체인으로 컴파일
pt_br: Compilar com cadeia de ferramentas do .NET Native
ru: Компиляция с помощью цепочки инструментов .NET Native

# EnableGatekeeperAudit.Text
source: Enable static analysis for .NET Native
es: Habilitar análisis estático para .NET Native
ja: .NET ネイティブのスタティック分析を有効にする
ko: .NET 네이티브용 정적 분석을 사용합니다.
pt_br: Habilitar análise estática para .NET Native
ru: Включить статический анализ для машинного кода .NET
