Repository: X-Sharp/XSharpPublic
Catalog: src/VisualStudio/SDKProjects/src/Microsoft.VisualStudio.Editors/PropPages/xlf/AssemblyInfoPropPage.*.xlf
Languages: es, ja

# TitleLabel.Text
source: &Title:
es: &Título:
ja: タイトル(&T):

# TrademarkLabel.Text
source: T&rademark:
es: Marca re&gistrada:
ja: 商標(&R):

# CopyrightLabel.Text
source: C&opyright:
ja: 著作権(&O):

# ProductLabel.Text
source: &Product:
es: &Producto:
ja: 製品(&P):

# CompanyLabel.Text
source: &Company:
es: &Compañía:
ja: 会社(&C):

# DescriptionLabel.Text
source: &Description:
es: &Descripción:
ja: 説明(&D):

# ComVisibleCheckBox.Text
source: &Make assembly COM-Visible
es: &Hacer visible el ensamblado COM
ja: アセンブリを COM 参照可能にする(&M)

# NeutralLanguageLabel.Text
source: &Neutral language:
es: &Lenguaje neutro:
ja: ニュートラル言語(&N):

# AssemblyVersionLabel.Text
source: &Assembly version:
es: &Versión del ensamblado:
ja: アセンブリ バージョン(&A):

# FileVersionLabel.Text
source: &File version:
es: Versión de &archivo:
ja: ファイル バージョン(&F):

# FileVersionMajorTextBox.AccessibleName
source: File Version major
es: Archivo de la versión principal
ja: ファイルのメジャー バージョン

# FileVersionMinorTextBox.AccessibleName
source: File Version minor
es: Versión secundaria del archivo
ja: ファイルのマイナー バージョン

# FileVersionBuildTextBox.AccessibleName
source: File Version build
es: Compilación de la versión de archivo
ja: ファイル バージョン ビルド

# FileVersionRevisionTextBox.AccessibleName
source: File Version revision
es: Revisión de la versión del archivo
ja: ファイル バージョン リビジョン

# GuidLabel.Text
source: &GUID:
ja: GUID(&G):

# AssemblyVersionMajorTextBox.AccessibleName
source: Assembly Version major
es: Versión del ensamblado principal
ja: アセンブリのメジャー バージョン

# AssemblyVersionMinorTextBox.AccessibleName
source: Assembly Version minor
es: Versión del ensamblado secundario
ja: アセンブリのマイナー バージョン

# AssemblyVersionBuildTextBox.AccessibleName
source: Assembly Version build
es: Compilación de versión de ensamblado
ja: アセンブリ バージョンのビルド

# AssemblyVersionRevisionTextBox.AccessibleName
source: Assembly Version revision
es: Revisión de versión de ensamblado
ja: アセンブリ バージョンのリビジョン
