Repository: X-Sharp/XSharpPublic
Catalog: src/VisualStudio/SDKProjects/src/Microsoft.VisualStudio.Editors/PropPages/xlf/DebugPropPage.*.xlf
Languages: ja, ko, pl, zh_hans

# AuthenticationModeLabel.Text
source: Authentication &mode:
ja: 認証モード(&M):
ko: 인증 모드(&M):
pl: Tryb uwi&erzytelniania:
zh_hans: 身份验证模式(&M):

# StartActionLabel.Text
source: Start action
ja: 開始動作
ko: 시작 작업
pl: Akcja uruchamiania
zh_hans: 启动操作

# rbStartProject.Text
source: &Start project
ja: スタート プロジェクト(&S)
ko: 시작 프로젝트(&S)
pl: &Uruchom projekt
zh_hans: 启动项目(&S)

# rbStartProgram.Text
source: Start e&xternal program:
ja: 外部プログラムの開始(&X):
ko: 시작 외부 프로그램(&X):
pl: Uruchom program z&ewnętrzny:
zh_hans: 启动外部程序(&X):

# rbStartURL.Text
source: Start browser with U&RL:
ja: ブラウザーを開始時に使用する URL(&R):
ko: 다음 URL로 브라우저 시작(&R):
pl: Uruchom przeglądarkę przy użyciu adresu U&RL:
zh_hans: 使用 URL 启动浏览器(&R):

# StartProgram.AccessibleName
source: Program to start
ja: 開始するプログラム
ko: 시작할 프로그램
pl: Program do uruchomienia
zh_hans: 要启动的程序

# StartURL.AccessibleName
source: URL to start browser with
ja: ブラウザーを開始時に使用する URL
ko: 브라우저를 시작할 때 사용할 URL
pl: Adres URL dla uruchomienia przeglądarki
zh_hans: 用于启动浏览器的 URL

# StartProgramBrowse.AccessibleName
source: Browse for external program
ja: 外部プログラムの参照
ko: 외부 프로그램 찾아보기
pl: Przeglądaj w poszukiwaniu programu zewnętrznego
zh_hans: 浏览外部程序

# StartProgramBrowse.Text
source: &Browse...
ja: 参照(&B)...
ko: 찾아보기(&B)...
pl: &Przeglądaj...
zh_hans: 浏览(&B)...

# StartOptionsLabel.Text
source: Start options
ja: 開始オプション
ko: 시작 옵션
pl: Opcje uruchamiania
zh_hans: 启动选项

# CommandLineArgsLabel.Text
source: Comma&nd line arguments:
ja: コマンド ライン引数(&N):
ko: 명령줄 인수(&N):
pl: Argumenty wiersza pole&cenia:
zh_hans: 命令行参数(&N):

# WorkingDirLabel.Text
source: Wor&king directory:
ja: 作業ディレクトリ(&K):
ko: 작업 디렉터리(&K):
pl: Katalog ro&boczy:
zh_hans: 工作目录(&K):

# RemoteDebugEnabled.Text
source: Use remote m&achine
ja: リモート コンピューターを使用する(&A)
ko: 원격 컴퓨터 사용(&A)
pl: Użyj m&aszyny zdalnej
zh_hans: 使用远程计算机(&A)

# RemoteDebugMachine.AccessibleName
source: Remote Machine Name:
ja: リモート コンピューター名:
ko: 원격 컴퓨터 이름:
pl: Nazwa maszyny zdalnej:
zh_hans: 远程计算机名称:

# StartWorkingDirectoryBrowse.AccessibleName
source: Browse for working directory
ja: 作業ディレクトリの参照
ko: 작업 디렉터리 찾아보기
pl: Przeglądaj w poszukiwaniu katalogu roboczego
zh_hans: 浏览工作目录

# StartWorkingDirectoryBrowse.Text
source: Bro&wse...
ja: 参照(&W)...
ko: 찾아보기(&W)...
pl: Prze&glądaj...
zh_hans: 浏览(&W)...

# EnableDebuggerLabel.Text
source: Debugger engines
ja: デバッガー エンジン
ko: 디버거 엔진
pl: Aparaty debugowania
zh_hans: 调试程序引擎

# EnableSQLServerDebugging.Text
source: Enable SQ&L Server debugging
ja: SQL Server デバッグを有効にする(&L)
ko: SQL Server 디버깅 사용(&L)
pl: Włącz debugowanie programu SQ&L Server
zh_hans: 启用 SQL Server 调试(&L)

# EnableUnmanagedDebugging.Text
source: Enable na&tive code debugging
ja: ネイティブ コード デバッグを有効にする(&T)
ko: 네이티브 코드 디버깅 사용(&T)
pl: Włącz na&tywne debugowanie kodu
zh_hans: 启用本地代码调试(&T)

# StartArguments.AccessibleName
source: Command line arguments
ja: コマンド ライン引数
ko: 명령줄 인수
pl: Argumenty wiersza polecenia
zh_hans: 命令行参数
