Repository: X-Sharp/XSharpPublic
Catalog: src/VisualStudio/SDKProjects/src/Microsoft.VisualStudio.Editors/PropPages/xlf/ServicesPropPage.*.xlf
Languages: cs, de, es, fr, it, ja, pl, pt_br, ru

# HelpLabel.Text
source: Client application services enable your Windows-based applications to use the ASP.NET login (authentication), roles, and profile (settings) services. Learn more about client application services...
cs: Klientské aplikační služby umožňují vašim aplikacím pro Windows použít služby technologie ASP.NET pro přihlášení (ověřování), role a nastavení profilu. Další informace o klientských aplikačních službách...
de: Dank Clientanwendungsdiensten können Ihre Windows-basierten Anwendungen die ASP.NET-Dienste für Anmeldung (Authentifizierung), Rollen und Profile (Einstellungen) nutzen. Erfahren Sie mehr über Clientanwendungsdienste
es: Los servicios de aplicación cliente permiten que las aplicaciones de Windows utilicen los servicios de inicio de sesión (autenticación), roles y perfil (configuración) de ASP.NET. Más información sobre los servicios de aplicación cliente...
fr: Les services d'applications clientes permettent à vos applications Windows d'utiliser les services de connexion ASP.NET (authentification), de rôle et de profil (paramètres). En savoir plus sur les services d'application cliente...
it: I servizi dell'applicazione client consentono alle applicazioni basate su Windows di usare accesso ASP.NET (autenticazione), ruoli e servizi profili (impostazioni). Altre informazioni sui servizi dell'applicazione client...
ja: クライアント アプリケーション サービスを使用すると、Windows ベースのアプリケーションから、ASP.NET ログイン (認証)、ロール、およびプロファイル (設定) サービスを使用できます。クライアント アプリケーション サービスに関する詳細の表示...
pl: Usługi aplikacji klienta w aplikacjach dla systemu Windows pozwalają używać funkcji logowania (uwierzytelniania), ról i usług profili (ustawień) środowiska ASP.NET. Dowiedz się więcej o usługach aplikacji klienckich…
pt_br: Serviços de aplicativo cliente habilitam seus aplicativos baseados em Windows a usarem o logon (autenticação), as funções e os serviços de perfil (configurações) do ASP.NET. Saiba mais sobre os serviços do aplicativo cliente...
ru: Службы клиентских приложений позволяют использовать в Windows приложениях службы ASP.NET входа (аутентификации), ролей и профиля (настроек). Дополнительные сведения о службах клиентских приложений...

# WindowsBasedAuth.Text
source: Use &Windows authentication
cs: Použít ověřování systému &Windows
de: Window&s-Authentifizierung verwenden
es: Usar autenticación de &Windows
fr: Utiliser l'authentification &Windows
it: Usa autenticazione di &Windows
ja: Windows 認証を使用する(&W)
pl: Użyj uwierzytelniania &systemu Windows
pt_br: Usar autenticação do &Windows
ru: Использовать &проверку подлинности Windows

# FormBasedAuth.Text
source: Use &Forms authentication
cs: Použít ověřování pomocí &formulářů
de: &Formularauthentifizierung verwenden
es: Usar autenticación de for&mularios
fr: Utiliser l'authentification par &formulaire
it: Usa autenticazione basata su &form
ja: フォーム認証を使用する(&F)
pl: Użyj uwierzytelniania &formularzy
pt_br: Usar autenticação de &Formulários
ru: Проверка подлиннос&ти на основе форм

# CustomCredentialProviderTypeLabel.Text
source: Optional: Credentials &provider (for example: MyNamespace.MyLoginClass, MyAssembly):
cs: Volitelné: &Poskytovatel pověření (např.: MyNamespace.MyLoginClass, MyAssembly):
de: Optional: Anmeldeinfor&mationsanbieter (Beispiel: EigenerNamespace.EigeneAnmeldeklasse, EigeneAssembly):
es: Opcional: Proveedor de cre&denciales (por ejemplo: MyNamespace.MyLoginClass, MyAssembly):
fr: Facultatif : Fournisseur d'informations d'i&dentification (par exemple, MyNamespace.MyLoginClass, MyAssembly) :
it: Facoltativo: &Provider di credenziali (ad esempio: MyNamespace.MyLoginClass, MyAssembly):
ja: オプション:資格情報プロバイダー(&P) (例:MyNamespace.MyLoginClass、MyAssembly):
pl: Opcjonalnie: &Dostawca poświadczeń (na przykład: PrzestrzeńNazw.KlasaLogowania, Zestaw):
pt_br: Opcional: &Provedor de credenciais (por exemplo: MyNamespace.MyLoginClass, MyAssembly):
ru: Дополнительно: П&оставщик учетных данных (например, MyNamespace.MyLoginClass, MyAssembly):

# AuthenticationServiceUrlLabel.Text
source: &Authentication service location:
cs: Umístění ověřov&ací služby:
de: Speicherort des &Authentifizierungsdiensts:
es: Ubicación del servicio de &autenticación:
fr: Emplacement du service d'&authentification :
it: Percorso del servizio di &autenticazione:
ja: 認証サービスの場所(&A):
pl: Lokalizacja usługi &uwierzytelniania:
pt_br: Local do serviço de &autenticação:
ru: &Расположение службы проверки подлинности:

# AuthenticationProviderGroupBox.Text
source: Authentication
cs: Ověření
de: Authentifizierung
es: Autenticación
fr: Authentification
it: Autenticazione
ja: 認証
pl: Uwierzytelnianie
pt_br: Autenticação
ru: Проверка подлинности

# RolesServiceUrlLabel.Text
source: &Roles service location:
cs: Umístění služby &rolí:
de: Speicherort des &Rollendiensts:
es: &Ubicación del servicio de rol:
fr: Emplacement des se&rvices de rôles :
it: Percorso del servizio &ruoli:
ja: ロール サービスの場所(&R):
pl: Lokalizacja usługi &ról:
pt_br: Local do serviço de &função:
ru: Расположение &службы роли:

# WebSettingsUrlLabel.Text
source: We&b settings service location:
cs: Umístění služ&by nastavení webu:
de: Speicherort des We&beinstellungsdiensts:
es: Ubicación del &servicio de configuración web:
fr: Emplacement des services de paramètres we&b :
it: Percorso del servizio impostazioni We&b:
ja: Web 設定サービスの場所(&B):
pl: Lokalizacja usługi ustawień sieci We&b:
pt_br: Local do serviço de configurações da We&b:
ru: Расположение службы &веб-параметров:

# AdvancedSettings.Text
source: A&dvanced...
cs: &Upřesnit...
de: Er&weitert...
es: Avan&zadas...
fr: Options a&vancées...
it: Avan&zate...
ja: 詳細設定(&D)...
pl: Za&awansowane...
pt_br: A&vançado...
ru: Д&ополнительно...

# EnableApplicationServices.Text
source: &Enable client application services
cs: Povolit kli&entské aplikační služby
de: Clientanwendungsdienste aktivi&eren
es: &Habilitar servicios de aplicación cliente
fr: Activ&er les services d'application cliente
it: Abilita ser&vizi dell'applicazione client
ja: クライアント アプリケーション サービスを有効にする(&E)
pl: &Włącz usługi aplikacji klienckich
pt_br: &Habilitar os serviços do aplicativo cliente
ru: Включить службы приложений &клиента
