Repository: X-Sharp/XSharpPublic
Catalog: src/VisualStudio/SDKProjects/src/Microsoft.VisualStudio.Editors/PropPages/xlf/Strings.*.xlf
Languages: cs, ru

# ErrorLoadingPermissions
source: Visual Studio was unable to determine the Code Access Security (CAS) permissions that are applicable to your project. The most likely cause is that your project references a strongly-named assembly that defines custom permissions, but that is not properly installed in the global assembly cache (GAC). To correct this, try the following: 1. Ensure that any custom permissions defining assemblies referenced by your project have been properly installed to the GAC. If any of these assemblies have been rebuilt or have had their version numbers modified, you must install the new assemblies in the GAC. 2. Restart Visual Studio.
cs: Sadě Visual Studio se nepodařilo rozpoznat oprávnění Code Access Security (CAS) platné pro projekt. Projekt pravděpodobně odkazuje na sestavení se silným názvem, které definuje vlastní oprávnění. Toto sestavení ale správně nainstalované v globální mezipaměti sestavení (GAC). Pokud to chcete opravit, zkuste použít následující postup: 1. Ujistěte se, že všechna sestavení definující vlastní oprávnění, na které projekt odkazuje, jsou správně nainstalovaná v GAC. Pokud byla některá z těchto sestavení znovu sestavena, nebo se změnila jejich verze, musíte do GAC tato nová sestavení nainstalovat. 2. Restartujte Visual Studio.
ru: Visual Studio не удалось определить разрешения системы управления доступом для кода, применимые для вашего проекта. Наиболее вероятная причина — проект ссылается на строго именованную сборку, которая определяет особые разрешения, но неправильно установлена в глобальном кэше сборок. Чтобы исправить это, выполните следующие действия. 1. Убедитесь, что все сборки с особыми разрешениями, на которые есть ссылки в проекте, правильно установлены в глобальном кэше сборок. Если какая-либо из таких сборок была перестроена или у нее изменился номер версии, нужно установить новые сборки в глобальном кэше сборок. 2. Перезапустите Visual Studio.

source: Install other frameworks...
cs: Nainstalovat jiné platformy...
ru: Установка других платформ...

# LanguageVersionAutomaticallySelected
source: Automatically selected based on framework version
cs: Automaticky vybráno na základě verze architektury
ru: Выбрано автоматически на основе версии платформы.

# FxCopAnalyzersInstallFailedMessage
source: Failed to install the latest Microsoft.CodeAnalysis.FxCopAnalyzers package
cs: Nepovedlo se nainstalovat nejnovější balíček Microsoft.CodeAnalysis.FxCopAnalyzers.
ru: Не удалось установить последний пакет Microsoft.CodeAnalysis.FxCopAnalyzers

# FxCopAnalyzersUninstallFailedMessage
source: Failed to uninstall Microsoft.CodeAnalysis.FxCopAnalyzers version '{0}'
cs: Nepovedlo se odinstalovat verzi {0} balíčku Microsoft.CodeAnalysis.FxCopAnalyzers.
ru: Не удалось удалить Microsoft.CodeAnalysis.FxCopAnalyzers версии {0}

source: No Authentication
cs: Bez ověřování
ru: без проверки подлинности

# RestoringPackagesMessage
source: Restoring Packages...
cs: Obnovují se balíčky...
ru: Восстановление пакетов...

# NotInstalledText
source: (not installed)
cs: (nenainstalováno)
ru: (не установлен)

source: Windows Authentication
cs: Ověřování systému Windows
ru: Аутентификация Windows

source: latest
cs: nejnovější
ru: последний

source: none
cs: žádné
ru: Нет

source: preview
ru: предварительная версия
