Repository: X-Sharp/XSharpPublic
Catalog: src/VsProjectSystem/src/Microsoft.VisualStudio.Editors/XmlToSchema/xlf/InputXmlForm.*.xlf
Languages: it, ru, tr

# _cancelButton.Text
source: Cancel
it: Annulla
ru: Отмена
tr: İptal

# ColumnHeader1.Text
source: Source Type
it: Tipo di origine
ru: Исходный тип
tr: Kaynak Türü

# ColumnHeader2.Text
source: XML Document Location
it: Percorso del documento XML
ru: Расположение XML-документа
tr: XML Belgesi Konumu

# _listView.AccessibleName
source: XML Documents
it: Documenti XML
ru: XML-документы
tr: XML Belgeleri

# _addAsTextButton.AccessibleName
source: Type or paste XML
it: Digita o incolla XML
ru: Ввести или вставить XML
tr: XML yaz veya yapıştır

# _addAsTextButton.Text
source: Type or paste &XML
it: Digita o incolla &XML
ru: &Ввести или вставить XML
tr: &XML yaz veya yapıştır

# Label1.Text
source: Specify XML documents to infer XML Schema set
it: Specificare i documenti XML da cui dedurre il set XML Schema
ru: Укажите XML-документы для вывода набора схем XML
tr: XML Şema kümesinin çıkarsanacağı XML belgelerini belirleyin

# _addFromFileButton.AccessibleName
source: Add from File
it: Aggiungi da file
ru: Добавить из файла
tr: Dosyadan Ekle

# _addFromFileButton.Text
source: Add from &File
it: Aggiungi da &file
ru: Добавить &из файла
tr: Dosyadan &Ekle

# _addFromWebButton.AccessibleName
source: Add from Web
it: Aggiungi da Web
ru: Добавить с веб-страницы
tr: Web’den Ekle

# _addFromWebButton.Text
source: Add from &Web
it: Aggiungi da &Web
ru: Добавить с &веб-страницы
tr: &Web’den Ekle

# _okButton.Text
source: OK
ru: ОК
tr: Tamam

# _xmlFileDialog.Filter
source: XML files (*.xml)|*.xml|All files (*.*)|*.*
it: File XML (*.xml)|*.xml|Tutti i file (*.*)|*.*
ru: XML-файлы (*.xml)|*.xml|Все файлы (*.*)|*.*
tr: XML dosyaları (*.xml)|*.xml|Tüm dosyalar (*.*)|*.*

# _xmlFileDialog.Title
source: Add XML Files
it: Aggiungi file XML
ru: Добавить XML-файлы
tr: XML Dosyaları Ekle

# $this.Text
source: Infer XML Schema set from XML documents
it: Deduci set XML Schema da documenti XML
ru: Вывод набора схем XML из XML-документов
tr: XML belgelerinden XML Şema kümesi çıkarsama
