Repository: X-Sharp/XSharpPublic
Catalog: src/VsProjectSystem/src/Microsoft.VisualStudio.ProjectSystem.Managed/ProjectSystem/Rules/Dependencies/xlf/ResolvedPackageReference.xaml.*.xlf
Languages: fr

# BoolProperty|GeneratePathProperty|Description
source: Indicates whether to generate an MSBuild property with the location of the package's root directory. The generated property name is in the form of 'Pkg[PackageID]', where '[PackageID]' is the ID of the package with any periods '.' replaced with underscores '_'.
fr: Indique s'il faut générer une propriété MSBuild avec l'emplacement du répertoire racine du package. Le nom de la propriété générée est au format 'Pkg[PackageID]', où '[PackageID]' est l'ID du package avec tous les points '.' remplacés par des traits de soulignement '_'.

# BoolProperty|GeneratePathProperty|DisplayName
source: Generate Path Property
fr: Générer une propriété Path

# Rule|ResolvedPackageReference|DisplayName
source: Package Reference
fr: Référence du package

# Rule|ResolvedPackageReference|Description
source: Package Reference Properties
fr: Propriétés de référence du package

# StringListProperty|Aliases|Description
source: A comma-delimited list of aliases to assembly references contained in this package.
fr: Liste d'éléments délimités par des virgules, qui correspondent aux d'alias des références d'assembly contenues dans ce package.

# StringListProperty|Aliases|DisplayName
source: Aliases
fr: Alias

# StringProperty|Version|Description
source: Version of dependency.
fr: Version de la dépendance.

# StringProperty|NoWarn|DisplayName
source: Suppress Warnings
fr: Supprimer les avertissements

# StringProperty|NoWarn|Description
source: Comma-delimited list of warnings that should be suppressed for this package.
fr: Liste d'avertissements délimités par des virgules, à supprimer pour ce package.

# StringProperty|IncludeAssets|DisplayName
source: Included Assets
fr: Composants inclus

# StringProperty|IncludeAssets|Description
source: Assets to include from this reference.
fr: Composants à inclure à partir de cette référence.

# StringProperty|ExcludeAssets|DisplayName
source: Excluded Assets
fr: Composants exclus

# StringProperty|ExcludeAssets|Description
source: Assets to exclude from this reference.
fr: Composants à exclure de cette référence.

# StringProperty|PrivateAssets|DisplayName
source: Private Assets
fr: Composants privés

# StringProperty|PrivateAssets|Description
source: Assets that are private in this reference.
fr: Composants privés dans cette référence.

# StringProperty|Path|Description
source: Location of the package being referenced.
fr: Emplacement du package actuellement référencé.

# StringProperty|Name|DisplayName
source: Name
fr: Nom

# StringProperty|Path|DisplayName
source: Path
fr: Chemin d'accès
