Repository: X-Sharp/XSharpPublic
Catalog: src/VsProjectSystem/src/Microsoft.VisualStudio.ProjectSystem.Managed/ProjectSystem/Rules/Dependencies/xlf/ResolvedSdkReference.xaml.*.xlf
Languages: fr, ja

# Rule|ResolvedSdkReference|DisplayName
source: SDK Reference
fr: Référence du kit SDK
ja: SDK 参照

# Rule|ResolvedSdkReference|Description
source: SDK Reference Properties
fr: Propriétés de la référence SDK
ja: SDK 参照のプロパティ

# StringProperty|AppXLocation|DisplayName
source: App Package Location
fr: Emplacement du package d'application
ja: アプリ パッケージの場所

# BoolProperty|CopyPayload|DisplayName
source: Copy Payload
fr: Copier la charge
ja: ペイロードのコピー

# BoolProperty|ExpandContent|DisplayName
source: Expand Content
fr: Développer le contenu
ja: コンテンツの展開

# BoolProperty|ExpandReferenceAssemblies|DisplayName
source: Expand Reference Assemblies
fr: Développer les assemblys de référence
ja: 参照アセンブリの展開

# BoolProperty|CopyLocalExpandedReferenceAssemblies|DisplayName
source: Copy Local Expanded Reference Assemblies
fr: Copier les assemblys de référence développés locaux
ja: ローカルに展開された参照アセンブリのコピー

# StringProperty|SDKRootFolder|DisplayName
source: SDK Root
fr: Racine du SDK
ja: SDK ルート

# StringProperty|Name|DisplayName
source: Name
fr: Nom
ja: 名前

# StringProperty|Version|DisplayName
source: Version
ja: バージョン

# StringProperty|CopyPayloadToSubDirectory|DisplayName
source: Copy Payload to Subdirectory
fr: Copier la charge dans le sous-répertoire
ja: サブディレクトリへのペイロードのコピー
