Repository: X-Sharp/XSharpPublic
Catalog: src/VsProjectSystem/src/Microsoft.VisualStudio.ProjectSystem.Managed/ProjectSystem/Rules/Dependencies/xlf/SdkReference.xaml.*.xlf
Languages: cs

# Rule|SdkReference|DisplayName
source: SDK Reference
cs: Odkaz na SDK

# Rule|SdkReference|Description
source: SDK Reference Properties
cs: Vlastnosti odkazu na sadu SDK

# StringProperty|SDKRootFolder|DisplayName
source: SDK Root
cs: Kořen SDK

# StringProperty|AppXLocation|DisplayName
source: App Package Location
cs: Umístění balíčku aplikace

# BoolProperty|CopyPayload|DisplayName
source: Copy Payload
cs: Kopírovat datovou část

# StringProperty|CopyPayloadToSubDirectory|DisplayName
source: Copy Payload to Subdirectory
cs: Kopírovat datovou část do podadresáře

# BoolProperty|ExpandContent|DisplayName
source: Expand Content
cs: Rozbalit obsah

# BoolProperty|ExpandReferenceAssemblies|DisplayName
source: Expand Reference Assemblies
cs: Rozbalit referenční sestavení

# BoolProperty|CopyLocalExpandedReferenceAssemblies|DisplayName
source: Copy Local Expanded Reference Assemblies
cs: Zkopírovat místní rozbalená referenční sestavení

# StringProperty|Name|DisplayName
source: Name
cs: Název

# StringProperty|Version|DisplayName
source: Version
cs: Verze
