Repository: X-Sharp/XSharpPublic
Catalog: src/VisualStudio/SDKProjects/src/Microsoft.VisualStudio.Editors/XmlToSchema/xlf/InputXmlForm.*.xlf
Languages: cs, de, es, fr, ja, ko, pl, pt_br, zh_hans, zh_hant

# _cancelButton.Text
source: Cancel
cs: Zrušit
de: Abbrechen
es: Cancelar
fr: Annuler
ja: キャンセル
ko: 취소
pl: Anuluj
pt_br: Cancelar
zh_hans: 取消
zh_hant: 取消

# ColumnHeader1.Text
source: Source Type
cs: Typ zdroje
de: Quelltyp
es: Tipo de origen
fr: Type de source
ja: ソースの種類
ko: 소스 형식
pl: Typ źródła
pt_br: Tipo de Origem
zh_hans: 源类型
zh_hant: 來源類型

# ColumnHeader2.Text
source: XML Document Location
cs: Umístění dokumentu XML
de: XML-Dokumentspeicherort
es: Ubicación de la documentación XML
fr: Emplacement du document XML
ja: XML ドキュメントの場所
ko: XML 문서 위치
pl: Lokalizacja dokumentu XML
pt_br: Local do Documento XML
zh_hans: XML 文档位置
zh_hant: XML 文件位置

# _listView.AccessibleName
source: XML Documents
cs: Dokumenty XML
de: XML-Dokumente
es: Documentos XML
fr: Documents XML
ja: XML ドキュメント
ko: XML 문서
pl: Dokumenty XML
pt_br: Documentos XML
zh_hans: XML 文档
zh_hant: XML 文件

# _addAsTextButton.AccessibleName
source: Type or paste XML
cs: Zadejte nebo vložte XML
de: XML eingeben oder einfügen
es: Escribir o pegar XML
fr: Entrer ou coller du code XML
ja: XML の入力または貼り付け
ko: XML 입력 또는 붙여넣기
pl: Wpisz lub wklej kod XML
pt_br: Digitar ou colar XML
zh_hans: 键入或粘贴 XML
zh_hant: 鍵入或貼上 XML

# _addAsTextButton.Text
source: Type or paste &XML
cs: Zadejte nebo vložte &XML
de: &XML eingeben oder einfügen
es: Escribir o pegar &XML
fr: Entrer ou coller du code &XML
ja: XML の入力または貼り付け(&X)
ko: XML 입력 또는 붙여넣기(&X)
pl: Wpisz lub wklej kod &XML
pt_br: Digitar ou colar &XML
zh_hans: 键入或粘贴 XML(&X)
zh_hant: 鍵入或貼上 XML(&X)

# Label1.Text
source: Specify XML documents to infer XML Schema set
cs: Zadat dokumenty XML pro odvození sady schémat XML
de: XML-Dokumente zur Ableitung des XML-Schemasets angeben
es: Especifique los documentos XML para inferir el conjunto de esquemas XML
fr: Spécifier les documents XML pour déduire le jeu de schémas XML
ja: XML スキーマ セットを推論する XML ドキュメントを指定する
ko: XML 스키마 집합을 유추하기 위해 XML 문서 지정
pl: Określ dokumenty XML do wywnioskowania zestawu schematu XML
pt_br: Especificar documentos XML para inferir conjunto de Esquemas XML
zh_hans: 指定 XML 文档以推断 XML 架构集
zh_hant: 指定要推斷 XML 結構描述集的 XML 文件

# _addFromFileButton.AccessibleName
source: Add from File
cs: Přidat ze souboru
de: Aus Datei hinzufügen
es: Agregar desde archivo
fr: Ajouter à partir d'un fichier
ja: ファイルから追加
ko: 파일에서 추가
pl: Dodaj z pliku
pt_br: Adicionar do Arquivo
zh_hans: 从文件添加
zh_hant: 從檔案新增

# _addFromFileButton.Text
source: Add from &File
cs: Přidat z&e souboru
de: Aus Datei hinzu&fügen
es: Agregar desde &archivo
fr: Ajouter à partir d'un &fichier
ja: ファイルから追加(&F)
ko: 파일에서 추가(&F)
pl: Dodaj z &pliku
pt_br: Adicionar do &Arquivo
zh_hans: 从文件添加(&F)
zh_hant: 從檔案新增(&F)

# _addFromWebButton.AccessibleName
source: Add from Web
cs: Přidat z webu
de: Aus dem Web hinzufügen
es: Agregar desde Web
fr: Ajouter à partir du web
ja: Web から追加
ko: 웹에서 추가
pl: Dodaj z sieci Web
pt_br: Adicionar da Web
zh_hans: 从 Web 添加
zh_hant: 從 Web 新增

# _addFromWebButton.Text
source: Add from &Web
cs: Přidat z &webu
de: Aus dem &Web hinzufügen
es: Agregar desde &Web
fr: Ajouter à partir du &web
ja: Web から追加(&W)
ko: 웹에서 추가(&W)
pl: Dodaj z sieci &Web
pt_br: Adicionar da &Web
zh_hans: 从 Web 添加(&W)
zh_hant: 從 Web 新增(&W)

# _okButton.Text
source: OK
es: Aceptar
ko: 확인
zh_hans: 确定
zh_hant: 確定

# _xmlFileDialog.Filter
source: XML files (*.xml)|*.xml|All files (*.*)|*.*
cs: Soubory XML (*.xml)|*.xml|Všechny soubory (*.*)|*.*
de: XML-Dateien (*.xml)|*.xml|Alle Dateien (*.*)|*.*
es: Archivos XML (*.xml)|*.xml|Todos los archivos (*.*)|*.*
fr: Fichiers XML (*.xml)|*.xml|Tous les fichiers (*.*)|*.*
ja: XML ファイル (*.xml)|*.xml|すべてのファイル (*.*)|*.*
ko: XML 파일(*.xml)|*.xml|모든 파일(*.*)|*.*
pl: Pliki XML (*.xml)|*.xml|Wszystkie pliki (*.*)|*.*
pt_br: Arquivos XML (*.xml)|*.xml|Todos os arquivos (*.*)|*.*
zh_hans: XML 文件(*.xml)|*.xml|所有文件(*.*)|*.*
zh_hant: XML 檔案 (*.xml)|*.xml|所有檔案 (*.*)|*.*

# _xmlFileDialog.Title
source: Add XML Files
cs: Přidat soubory XML
de: XML-Dateien hinzufügen
es: Agregar archivos XML
fr: Ajouter les fichiers XML
ja: XML ファイルの追加
ko: XML 파일 추가
pl: Dodaj pliki XML
pt_br: Adicionar Arquivos XML
zh_hans: 添加 XML 文件
zh_hant: 新增 XML 檔案

# $this.Text
source: Infer XML Schema set from XML documents
cs: Odvodit sadu XML schémat z dokumentů XML
de: XML-Schemaset aus XML-Dokumenten ableiten
es: Inferir conjunto de esquemas XML de documentos XML
fr: Déduire le jeu de schémas XML des documents XML
ja: XML ドキュメントからの XML スキーマ セットの推論
ko: XML 문서에서 XML 스키마 집합 유추
pl: Wywnioskuj zestaw schematu XML na podstawie dokumentów XML
pt_br: Inferir conjunto de Esquemas XML a partir de documentos XML
zh_hans: 从 XML 文档推断 XML 架构集
zh_hant: 從 XML 文件推斷 XML 結構描述集
