Repository: X-Sharp/XSharpPublic
Catalog: src/VsProjectSystem/src/Microsoft.VisualStudio.Editors/Resources/xlf/MyExtensibilityRes.*.xlf
Languages: tr

# AssemblyOptionDialog_Add_Question
source: The following My Namespace extensions are associated with assembly '{0}'. Do you want to add them to your project?
tr: Aşağıdaki My Namespace uzantıları, '{0}' bütünleştirilmiş kodu ile ilişkili. Bunları projenize eklemek istiyor musunuz?

# AssemblyOptionDialog_Add_Text
source: Add My Namespace Extensions
tr: My Namespace Uzantılarını Ekle

# AssemblyOptionDialog_Option
source: &Remember my decision for '{0}'.
tr: '{0}' için kararımı &hatırla.

# AssemblyOptionDialog_Remove_Question
source: Removing the reference to '{0}' will make the following My Namespace extensions stop functioning. Do you want to remove them as well?
tr: '{0}' başvurusunun kaldırılması, aşağıdaki My Namespace uzantılarının çalışmasını durduracak. Bunları da kaldırmak istiyor musunuz?

# AssemblyOptionDialog_Remove_Text
source: Remove My Namespace Extensions
tr: My Namespace Uzantılarını Kaldır

# CouldNotAddProjectItemTemplate_Message
source: No project items were added to the current project from My Namespace extension '{0}'. The extension will not be added to the project.
tr: Geçerli projeye, '{0}' My Namespace uzantısından proje öğesi eklenmedi. Uzantı, projeye eklenmeyecek.

# CouldNotAddProjectItemTemplate_Title
source: Failed to Add Project Item
tr: Proje Öğesi Eklenemedi

# CouldNotSetExtensionAttributes_AllItems
source: No project items could be associated with My Namespace extension '{0}'. The extension will not be added to the project.
tr: '{0}' My Namespace uzantısıyla ilişkilendirilebilen proje öğesi yok. Uzantı, projeye eklenmeyecek.

# CouldNotSetExtensionAttributes_Message
source: Project item '{0}' was added to the current project but could not be associated with My Namespace extension '{1}'. It will not be removed with the extension.
tr: '{0}' proje öğesi geçerli projeye eklendi, ancak '{1}' My Namespace uzantısı ile ilişkilendirilemedi. Proje öğesi uzantıyla birlikte kaldırılmayacak.

# CouldNotSetExtensionAttributes_Title
source: Failed to Set Extension Attributes
tr: Uzantı Öznitelikleri Ayarlanamadı

# ExtensionExists_Message
source: Version '{0}' of My Namespace extension '{1}' already exists in the current project. Do you want to overwrite it with version '{2}'?
tr: '{1}' My Namespace uzantısının '{0}' sürümü geçerli projede zaten var. '{2}' sürümünü üzerine yazmak istiyor musunuz?

# ExtensionExists_Title
source: Extension File Already Exists
tr: Uzantı Dosyası Zaten Var

# PropertyPageTab
source: My Extensions
tr: Uzantılarım

# StatusBar_Add_Finish
source: My Namespace extensions added: '{0}'.
tr: My Namespace uzantıları eklendi: '{0}'.

# StatusBar_Add_Progress
source: My Namespace extension added: '{0}'.
tr: My Namespace uzantısı eklendi: '{0}'.

# StatusBar_Add_Remove_Finish
source: My Namespace extensions added: '{0}'. My Namespace extensions removed: '{1}'.
tr: My Namespace uzantıları eklendi: '{0}'. My Namespace uzantıları kaldırıldı: '{1}'.

# StatusBar_Add_Start
source: Adding My Namespace extensions...
tr: My Namespace uzantıları ekleniyor...

# StatusBar_Remove_Finish
source: My Namespace extensions removed: '{0}'.
tr: My Namespace uzantıları kaldırıldı: '{0}'.

# StatusBar_Remove_Progress
source: My Namespace extension removed: '{0}'.
tr: My Namespace uzantısı kaldırıldı: '{0}'.

# StatusBar_Remove_Start
source: Removing My Namespace extensions...
tr: My Namespace uzantıları kaldırılıyor...
