Repository: X-Sharp/XSharpPublic
Catalog: src/VisualStudio/SDKProjects/src/Microsoft.VisualStudio.ProjectSystem.Managed.VS/xlf/Menus.vsct.*.xlf
Languages: es, ja, zh_hant

# cmdidNavigateToProject|ButtonText
source: N&avigate to Project
es: &Navegar al proyecto
ja: プロジェクトに移動(&A)
zh_hant: 瀏覽至專案(&A)

# cmdidProjectDebugger|ButtonText
source: Web Debugger
es: Depurador web
ja: Web デバッガー
zh_hant: Web 偵錯工具

# cmdidGenerateNuGetPackageProjectContextMenu|ButtonText
source: &Pack
es: &Paquete
ja: パック(&P)
zh_hant: 封裝(&P)

# cmdidGenerateNuGetPackageProjectContextMenu|ToolTipText
source: Generate NuGet Package
es: Generar paquete NuGet
ja: NuGet パッケージを生成する
zh_hant: 產生 NuGet 套件

# cmdidGenerateNuGetPackageTopLevelBuild|ButtonText
source: &Pack selection
es: Selección de &paquete
ja: パックの選択(&P)
zh_hant: 封裝選取項目(&P)

# cmdidGenerateNuGetPackageTopLevelBuild|ToolTipText
source: Generate NuGet Package for selected project
es: Generar paquete NuGet para el proyecto seleccionado
ja: 選択したプロジェクトの NuGet パッケージを生成する
zh_hant: 為選取的專案產生 NuGet 套件

# DebugTargetMenuDebugFrameworkMenu|ButtonText
source: Framework
es: Plataforma
ja: フレームワーク
zh_hant: 架構

# cmdidDebugFrameworks|ButtonText
source: Framework
es: Plataforma
ja: フレームワーク
zh_hant: 架構

# AddAboveMenu|ButtonText
source: &Add Above
es: Agregar &encima
ja: 上に追加(&A)
zh_hant: 在上方新增(&A)

# cmdidAddNewItemAbove|ButtonText
source: &Add New Item...
es: Agregar &nuevo elemento
ja: 新しい項目の追加(&A)...
zh_hant: 新增新項目(&A)...

# AddBelowMenu|ButtonText
source: &Add Below
es: Agregar de&bajo
ja: 下に追加(&A)
zh_hant: 在下方新增(&A)

# cmdidAddExistingItemAbove|ButtonText
source: &Add Existing Item...
es: Agregar elemento existe&nte
ja: 既存項目の追加(&A)...
zh_hant: 新增現有項目(&A)...

# cmdidAddNewItemBelow|ButtonText
source: &Add New Item...
es: Agregar &nuevo elemento
ja: 新しい項目の追加(&A)...
zh_hant: 新增新項目(&A)...

# cmdidAddExistingItemBelow|ButtonText
source: &Add Existing Item...
es: Agregar elemento existe&nte
ja: 既存項目の追加(&A)...
zh_hant: 新增現有項目(&A)...
