Repository: X-Sharp/XSharpPublic
Catalog: src/VsProjectSystem/src/Microsoft.VisualStudio.Editors/PropPages/xlf/ServicesPropPage.*.xlf
Languages: ko, tr, zh_hans, zh_hant

# HelpLabel.Text
source: Client application services enable your Windows-based applications to use the ASP.NET login (authentication), roles, and profile (settings) services. Learn more about client application services...
ko: 클라이언트 애플리케이션 서비스를 사용하면 Windows 기반 애플리케이션에서 ASP.NET 로그인(인증), 역할 및 프로필(설정) 서비스를 사용할 수 있습니다. 클라이언트 애플리케이션 서비스에 대한 자세한 정보...
tr: İstemci uygulama hizmetleri Windows tabanlı uygulamalarınızın ASP.NET oturum açma (kimlik doğrulaması), rol ve profil (ayarlar) hizmetlerini kullanmasını sağlar. İstemci uygulama hizmetleri hakkında daha fazla bilgi edinin...
zh_hans: 客户端应用程序服务使基于 Windows 的应用程序能够使用 ASP.NET 登录(身份验证)、角色和配置文件(设置)服务。了解有关客户端应用程序服务的更多信息...
zh_hant: 用戶端應用程式服務可以讓您的 Windows 應用程式使用 ASP.NET 登入 (驗證)、角色和設定檔 (設定) 服務。進一步了解用戶端應用程式服務...

# WindowsBasedAuth.Text
source: Use &Windows authentication
ko: Windows 인증 사용(&W)
tr: &Windows kimlik doğrulaması kullan
zh_hans: 使用 Windows 身份验证(&W)
zh_hant: 使用 Windows 驗證(&W)

# FormBasedAuth.Text
source: Use &Forms authentication
ko: 폼 인증 사용(&F)
tr: &Forms kimlik doğrulaması kullan
zh_hans: 使用 Forms 身份验证(&F)
zh_hant: 使用表單驗證(&F)

# CustomCredentialProviderTypeLabel.Text
source: Optional: Credentials &provider (for example: MyNamespace.MyLoginClass, MyAssembly):
ko: 옵션: 자격 증명 공급자(&P) (예: MyNamespace.MyLoginClass, MyAssembly):
tr: İsteğe bağlı: Kimlik bilgileri &sağlayıcısı (örneğin: MyNamespace.MyLoginClass, MyAssembly):
zh_hans: 可选:凭据提供程序(&P) (例如:MyNamespace.MyLoginClass、MyAssembly):
zh_hant: 選擇性:認證提供者(&P) (例如:MyNamespace.MyLoginClass、MyAssembly):

# AuthenticationServiceUrlLabel.Text
source: &Authentication service location:
ko: 인증 서비스 위치(&A):
tr: &Kimlik doğrulama hizmeti konumu:
zh_hans: 身份验证服务位置(&A):
zh_hant: 驗證服務位置(&A):

# AuthenticationProviderGroupBox.Text
source: Authentication
ko: 인증
tr: Kimlik doğrulama
zh_hans: 身份验证
zh_hant: 驗證

# RolesServiceUrlLabel.Text
source: &Roles service location:
ko: 역할 서비스 위치(&R):
tr: &Rol hizmeti konumu:
zh_hans: 角色服务位置(&R):
zh_hant: 角色服務位置(&R):

# WebSettingsUrlLabel.Text
source: We&b settings service location:
ko: 웹 설정 서비스 위치(&B):
tr: We&b ayarları hizmet konumu:
zh_hans: Web 设置服务位置(&B):
zh_hant: Web 設定服務位置(&B):

# AdvancedSettings.Text
source: A&dvanced...
ko: 고급(&D)...
tr: G&elişmiş...
zh_hans: 高级(&D)...
zh_hant: 進階(&D)...

# EnableApplicationServices.Text
source: &Enable client application services
ko: 클라이언트 애플리케이션 서비스 사용(&E)
tr: &İstemci uygulama hizmetlerini etkinleştir
zh_hans: 启用客户端应用程序服务(&E)
zh_hant: 啟用用戶端應用程式服務(&E)
