Repository: X-Sharp/XSharpPublic
Catalog: src/VisualStudio/SDKProjects/src/Microsoft.VisualStudio.Editors/Resources/xlf/Microsoft.VisualStudio.Editors.Designer.*.xlf
Languages: ru

# SD_ERR_CantAuthenticate
source: The username/password combination cannot be authenticated.
ru: Подлинность имени пользователя и пароля не может быть проверена.

# PPG_WindowsFormsApp
source: Windows Forms Application
ru: Приложение Windows Forms

# PPG_ServiceReferenceTypeName
source: Service Reference Properties
ru: Свойства ссылки на службу

# PPG_ServiceReferenceProperty_MultipleUrlNotSupported
source: A service reference with multiple source urls is not supported.
ru: Не поддерживаются ссылки на службу несколькими исходными url.

# PPG_ServiceReferenceProperty_SetReferenceUrlEmpty
source: Cannot change reference Url to empty. The reference url must be a valid URL.
ru: Нельзя изменить URL-адрес ссылки на пустой. URL-адрес ссылки должен быть действительным URL-адресом.

# DFX_OneOrMoreFilesReloaded
source: One or more files were reloaded during the checkout. Please retry your operation.
ru: Во время извлечения был перезагружен один или несколько файлов. Повторите операцию.

# XmlToSchema_InvalidXMLFormat
source: Invalid XML Format: {0}
ru: Недопустимый формат XML: {0}

# XmlToSchema_Error
source: Error: {0}
ru: Ошибка: {0}

# XmlToSchema_ErrorInXmlInference
source: Error during XML schema inference: {0}
ru: Ошибка при определении схемы XML: {0}

# XmlToSchema_ErrorLoadingXml
source: Error loading XML: {0}
ru: Ошибка при загрузке XML: {0}

# XmlToSchema_InvalidEmptyItemName
source: Invalid empty project item name.
ru: Недопустимое имя пустого элемента проекта.

# XmlToSchema_InvalidProjectPath
source: Invalid project path: {0}
ru: Недопустимый путь к проекту: {0}

# XmlToSchema_NoProjectSelected
source: No project selected.
ru: Проект не выбран.

# CSRDlg_MultipleURL
source: Multiple addresses (editable in .svcmap file)
ru: Несколько адресов (изменяются в файле .svcmap)

# PPG_WinMDObj
source: Windows Runtime Component
ru: Компонент среды выполнения Windows

# PPG_AppContainerExe
source: Windows Store App
ru: Приложение Магазина Windows

# PPG_UnknownOutputType
source: Unknown output type: {0}
ru: Неизвестный тип выходных данных: {0}

# SD_DefaultSettingName
source: Setting
ru: Параметр

# PropPage_ComputingCurrentImportsMessage
source: Computing current imports...
ru: Вычисление текущих операций импорта...

# PropPage_CurrentImportsTitle
source: Current Imports
ru: Текущие операции импорта

# PPG_PackageTitle
source: Package
ru: Пакет

# PPG_Property_PackageVersion
source: Package Version
ru: Версия пакета

# PPG_AdvancedBuildSettings_ReportCompilerErrors_None
source: None
ru: Нет

# PPG_AdvancedBuildSettings_ReportCompilerErrors_Prompt
source: Prompt
ru: Приглашение

# PPG_AdvancedBuildSettings_ReportCompilerErrors_Queue
source: Queue
ru: Очередь

# PPG_AdvancedBuildSettings_ReportCompilerErrors_Send
source: Send
ru: Отправка

# PPG_AdvancedBuildSettings_DebugInfo_Embedded
source: Embedded
ru: Встроенный

# PPG_AdvancedBuildSettings_DebugInfo_Full
source: Full
ru: Полное

# PPG_AdvancedBuildSettings_DebugInfo_None
source: None
ru: Нет

# PPG_AdvancedBuildSettings_DebugInfo_PdbOnly
source: Pdb-only
ru: Только PDB

# PPG_AdvancedBuildSettings_DebugInfo_Portable
source: Portable
ru: Переносимый

# BlockedResx
source: Unable to load '{0}' because it is not trusted.
ru: Невозможно загрузить "{0}" из-за отсутствия доверия.

# RSE_Type_WMF
source: Windows Metafile
ru: Метафайл Windows

# RSE_Type_EMF
source: Extended Metafile
ru: Расширенный метафайл

# RSE_Filter_License
source: License Files
ru: Файлы лицензии
