Repository: X-Sharp/XSharpPublic
Catalog: src/VisualStudio/SDKProjects/src/Microsoft.VisualStudio.Editors/Resources/xlf/Microsoft.VisualStudio.Editors.Designer.*.xlf
Languages: ru

# CMN_AllFilesFilter
source: All Files
ru: Все файлы

# PPG_BuildSettings_Nullable_Annotations
source: Annotations
ru: Заметки

# PPG_BuildSettings_Nullable_Disable
source: Disable
ru: Отключить

# PPG_BuildSettings_Nullable_Enable
source: Enable
ru: Включить

# PPG_BuildSettings_Nullable_Warnings
source: Warnings
ru: Предупреждения

# PPG_ReferencesTitle
source: References
ru: Ссылки

# PPG_ApplicationTitle
source: Application
ru: Приложение

# PPG_CompileTitle
source: Compile
ru: Компиляция

# PPG_DebugTitle
source: Debug
ru: Отладка

# PPG_BuildTitle
source: Build
ru: Сборка

# PPG_BuildEventsTitle
source: Build Events
ru: События сборки

# PPG_ReferencePathsTitle
source: Reference Paths
ru: Пути для ссылок

# PPG_PreBuildCommandLineTitle
source: Pre-build Event Command Line
ru: Командная строка события перед сборкой

# PPG_PostBuildCommandLineTitle
source: Post-build Event Command Line
ru: Командная строка события после сборки

# PPG_OutputPathNotSecure
source: The output path is not trusted. The application may throw security exceptions when it attempts to perform actions which require full trust. Click OK to ignore and continue. Click CANCEL to choose a different output path.
ru: Выходной путь не является доверенным. При выполнении действий, требующих полного доверия, приложение может создавать исключения системы безопасности. Чтобы пропустить и продолжить, нажмите кнопку ОК. Чтобы выбрать другой выходной путь, нажмите кнопку "Отмена".

# PPG_BrowseText
source: <Browse...>
ru: <Обзор...>

# PPG_ComboBoxSelect_None
source: (None)
ru: (Нет)

# PPG_NeutralLanguage_None
source: (None)
ru: (Нет)

# PPG_AddExistingFilesTitle
source: Add existing file to project
ru: Добавить существующий файл в проект

# PPG_AddIconFilesFilter
source: Icon Files
ru: Файлы значков

# PPG_ExeFilesFilter
source: Executable Files
ru: Исполняемые файлы

# PPG_SelectWorkingDirectoryTitle
source: Select Working Directory
ru: Выбор рабочего каталога

# PPG_SelectOutputPathTitle
source: Select Output Path
ru: Выбор пути для вывода

# PPG_SelectReferencePath
source: Select Reference Path
ru: Выберите путь для ссылки

# PPG_AddWin32ResourceFilter
source: Win32 Resource Files
ru: Файлы ресурсов Win32

# PPG_AddWin32ResourceTitle
source: Add Win32 resource file to project
ru: Добавить файл ресурсов Win32 в проект

# PPG_InvalidFolderPath
source: Folder path does not exist. Please select a valid folder path.
ru: Путь к папке не существует. Выберите допустимый путь к папке.

# PPG_AdvancedCompilerSettings_Title
source: Advanced Compiler Settings
ru: Расширенные параметры компилятора

# PPG_AdvancedBuildSettings_Title
source: Advanced Build Settings
ru: Расширенные параметры сборки

# PPG_ReferencePaths_Title
source: Reference Paths
ru: Пути для ссылок

# PPG_AssemblyInfo_Title
source: Assembly Information
ru: Сведения о сборке

# PPG_AssemblyInfo_InvalidVersion
source: Invalid version format, expected "[Major]", "[Major].[Minor]", "[Major].[Minor].[Build]" or "[Major].[Minor].[Build].[Revision]"
ru: Недопустимый формат версии, ожидаемый [Основной номер], [Основной номер].[Дополнительный номер], [Основной номер].[Дополнительный номер].[Сборка] или [Основной номер].[Дополнительный номер].[Сборка].[Редакция]

# PPG_AssemblyInfo_BadWildcard
source: A wildcard ("*") is not allowed in this field.
ru: Подстановочный символ ("*") недопустим в этом поле.

# PPG_AssemblyInfo_VersionOutOfRange_2Args
source: Each part of the version number for '{0}' must be an integer between 0 and {1}.
ru: Каждый компонент номера версии для "{0}" должен быть целым числом в диапазоне от 0 до {1}.

# PPG_Application_DefaultIconText
source: (Default Icon)
ru: (Значок по умолчанию)

# PPG_Application_InvalidSubMainStartup
source: Startup object must be a form when 'Enable application framework' is checked.
ru: Если установлен флажок "Включить исполняющую среду", автоматически запускаемый объект должен быть формой.

# PPG_Application_StartupObjectNotSet
source: (Not set)
ru: (Не задано)

# PPG_Application_CantAddIcon
source: Icon could not be added to the project.
ru: Не удалось добавить значок в проект.

# PPG_Application_BadIcon
source: Invalid icon file.
ru: Недопустимый файл значка.

# PPG_Application_BadIcon_1Arg
source: {0} is not a valid icon file.
ru: "{0}" не является действительным файлом значка.

# PPG_Application_BadGuid
source: The GUID should match the format dddddddd-dddd-dddd-dddd-dddddddddddd.
ru: GUID должен иметь следующий формат dddddddd-dddd-dddd-dddd-dddddddddddd.

# PPG_Application_MyAppCommentLine1
source: NOTE: This file is auto-generated; do not modify it directly. To make changes,
ru: ПРИМЕЧАНИЕ. Этот файл создан автоматически; не изменяйте его самостоятельно. Для внесения изменений

# PPG_Application_MyAppCommentLine2
source: or if you encounter build errors in this file, go to the Project Designer
ru: или, если в ходе сборки обнаружены ошибки в этом файле, перейдите в конструктор проектов

# PPG_Application_MyAppCommentLine3
source: (go to Project Properties or double-click the My Project node in
ru: (перейдите к свойствам проекта или дважды щелкните узел "Мой проект" в

# PPG_Application_MyAppCommentLine4
source: Solution Explorer), and make changes on the Application tab.
ru: обозревателе решений), и внесите изменения на вкладке "Приложение".

# PPG_Application_InvalidIdentifierStartupForm_1Arg
source: '{0}' is not a valid identifier. Please select a different Startup form.
ru: "{0}" не является допустимым идентификатором. Выберите другую начальную форму.

# PPG_Application_InvalidIdentifierSplashScreenForm_1Arg
source: '{0}' is not a valid identifier. Please select a different Splash screen form.
ru: "{0}" не является допустимым идентификатором. Выберите другую форму экрана-заставки.

# PPG_Application_SplashSameAsStart
source: The splash screen form cannot be the start-up form.
ru: Форма заставки не может быть начальной формой.

# PPG_Application_StartupFormLabelText
source: Startup f&orm:
ru: Ф&орма запуска:

# PPG_Application_AppEventsCommentLine1
source: The following events are available for MyApplication:
ru: Для MyApplication имеются следующие события:

# PPG_Application_AppEventsCommentLine3
source: Startup: Raised when the application starts, before the startup form is created.
ru: Startup: возникает при запуске приложения перед созданием начальной формы.

# PPG_Application_AppEventsCommentLine4
source: Shutdown: Raised after all application forms are closed. This event is not raised if the application terminates abnormally.
ru: Shutdown: возникает после закрытия всех форм приложения. Это событие не создается, если происходит аварийное завершение работы приложения.

# PPG_Application_AppEventsCommentLine5
source: UnhandledException: Raised if the application encounters an unhandled exception.
ru: UnhandledException: возникает, если в приложении обнаруживается необработанное исключение.

# PPG_Application_AppEventsCommentLine6
source: StartupNextInstance: Raised when launching a single-instance application and the application is already active.
ru: StartupNextInstance: возникает при запуске приложения, допускающего одновременное выполнение только одного экземпляра, если это приложение уже активно.

# PPG_Application_AppEventsCommentLine7
source: NetworkAvailabilityChanged: Raised when the network connection is connected or disconnected.
ru: NetworkAvailabilityChanged: возникает при изменении состояния подключения — при подключении или отключении.

# PPG_AdvancedBuildSettings_InvalidBaseAddress
source: Base address must be a hexadecimal number with less than or equal to 8 digits, for example, 0x11000000.
ru: Базовый адрес должен быть шестнадцатеричным числом (длина — не более 8 цифр), например: 0x11000000.

# PPG_Compile_Notification_None
source: None
ru: Нет

# PPG_Compile_Notification_Warning
source: Warning
ru: Предупреждение

# PPG_Compile_Notification_Error
source: Error
ru: Ошибка

# PPG_Compile_OptionStrict_Custom
source: (custom)
ru: (Настраиваемое)

# PPG_Compile_42016
source: Implicit conversion
ru: Неявное преобразование

# PPG_Compile_42017_42018_42019
source: Late binding; call could fail at run time
ru: Позднее связывание; возможный сбой вызова во время выполнения

# PPG_Compile_42020
source: Implicit type; object assumed
ru: Неявный тип; предполагается объект

# PPG_Compile_42104
source: Use of variable prior to assignment
ru: Использование переменной до инициализации

# PPG_Compile_42105_42106_42107
source: Function returning reference type without return value
ru: Функция возвращает ссылочный тип без возвращаемого значения

# PPG_Compile_42353_42354_42355
source: Function returning intrinsic value type without return value
ru: Функция возвращает встроенный тип значения без возвращаемого значения

# PPG_Compile_42024
source: Unused local variable
ru: Неиспользуемая локальная переменная

# PPG_Compile_42025
source: Instance variable accesses shared member
ru: Обращение к общему члену через переменную-экземпляр

# PPG_Compile_42004
source: Recursive operator or property access
ru: Рекурсивный оператор или доступ к свойству

# PPG_Compile_42029
source: Duplicate or overlapping catch blocks
ru: Повторяющиеся или перекрывающиеся блоки catch

# PPG_Compile_ResetIndeterminateWarningLevels
source: The warning settings for one or more configurations conflict. Changing this setting will reset the settings in all configurations.
ru: Параметры предупреждений для одной или нескольких конфигураций конфликтуют. Изменение этого параметра приведет к сбросу параметров во всех конфигурациях.

# PPG_MyApplication_StartupMode_FormCloses
source: When startup form closes
ru: Когда закрывается начальная форма

# PPG_MyApplication_StartupMode_AppExits
source: When last form closes
ru: Когда закрывается последняя форма

# PPG_MyApplication_AuthenMode_ApplicationDefined
source: Application-defined
ru: Определяется приложением

# PPG_WindowsApp
source: Windows Application
ru: Приложение Windows

# PPG_WindowsService
source: Windows Service
ru: Служба Windows

# PPG_WindowsClassLib
source: Class Library
ru: Библиотека классов

# PPG_CommandLineApp
source: Console Application
ru: Консольное приложение

# PPG_WebControlLib
source: Web Control Library
ru: Библиотека веб-элементов управления

# PPG_Reference_CanNotRemoveReference
source: Cannot remove '{0}'. {1}
ru: Невозможно удалить "{0}". {1}

# PPG_Reference_RemoveImportsFailUnexpected
source: Adding or removing '{0}' as a project import failed because of an unexpected error from the project system. The error returned was: '{1}'.
ru: Не удалось добавить или удалить "{0}" в ходе импорта проекта из-за непредвиденной ошибки в подсистеме управления проектами. Возвращена ошибка: {1}.

# PPG_Reference_AddWebReference
source: Adding web reference failed. {0}
ru: Не удалось добавить веб-ссылку. {0}

# PPG_Reference_FailedToUpdateWebReference
source: Updating web reference '{0}' failed. {1}
ru: Не удалось обновить веб-ссылку "{0}". {1}

# PPG_WebReferenceTypeName
source: Web Reference Properties
ru: Свойства веб-ссылки

# PPG_UrlBehavior_Static
source: Static
ru: Статическая

# PPG_UrlBehavior_Dynamic
source: Dynamic
ru: Динамическая

# PropPage_InvalidCharactersInFilePath
source: "Invalid characters in file path."
ru: "Недопустимые символы в пути к файлу."

# PropPage_RemoteMachineBlankError
source: The remote machine name cannot be blank. Please specify the name of the machine to debug remotely.
ru: Имя удаленного компьютера не может быть пустым. Укажите имя компьютера для удаленной отладки.

# PropPage_ProgramNotExist
source: The external program cannot be found. Please enter a valid executable file.
ru: Невозможно найти внешнюю программу. Укажите допустимый исполняемый файл.

# PropPage_NeedExternalProgram
source: The external program property cannot be empty. Please enter a valid executable file.
ru: Свойство внешней программы не может быть пустым. Укажите допустимый исполняемый файл.

# PropPage_NotAnExeError
source: We can only debug an EXE file. Please enter a valid executable file.
ru: Поддерживается отладка только EXE-файлов. Укажите допустимый исполняемый файл.

# PropPage_NeedURL
source: The URL property cannot be empty. Please enter a valid URL.
ru: Свойство URL не может быть пустым. Введите допустимый URL-адрес.

# PropPage_InvalidURL
source: The URL is invalid. Please enter a valid URL like "http://www.microsoft.com/"
ru: URL-адрес недопустим. Введите допустимый URL-адрес, например http://www.microsoft.com/.

# PropPage_WorkingDirError
source: The working directory you entered does not exist. Please enter a valid working directory.
ru: Указанный рабочий каталог не существует. Введите допустимый рабочий каталог.

# PropPage_ReferenceNotFound
source: <The system cannot find the reference specified>
ru: <Системе не удается найти указанную ссылку>

# PropPage_ImportedNamespacesTitle
source: Imported Namespaces
ru: Импортированные пространства имен

# PropPage_ComputingReferencedNamespacesMessage
source: Computing referenced namespaces...
ru: Вычисление пространств имен, на которые указывают ссылки...

# PropPage_UnusedReferenceTitle
source: Unused References
ru: Неиспользуемые ссылки

# PropPage_UnusedReferenceRemoveButton
source: &Remove
ru: &Удалить

# PropPage_UnusedReferenceNoUnusedReferences
source: No unused references
ru: Нет неиспользуемых ссылок

# PropPage_UnusedReferenceCompileFail
source: Project compilation failed. Cannot determine unused references.
ru: Сбой компиляции проекта. Невозможно определить неиспользуемые ссылки.

# PropPage_UnusedReferenceCompileWaiting
source: Gathering list of unused references...
ru: Формирование списка неиспользуемых ссылок...

# PropPage_UnusedReferenceError
source: Error getting unused references.
ru: Ошибка при получении неиспользуемых ссылок.

# PPG_InvalidHexString
source: Base address must be a hexadecimal number with less than or equal to 8 digits, for example, &H11000000.
ru: Базовый адрес должен представлять собой шестнадцатеричное число, включающее не более 8 цифр, например, &H11000000.

# PropPage_NeedResFile
source: "Resource files must have a .res file extension. Please enter a valid resource file name."
ru: "У файлов ресурсов должно быть расширение RES. Укажите допустимое имя файла ресурсов".

# PropPage_ResourceFileNotExist
source: "The resource file entered does not exist."
ru: "Указанный файл ресурсов не существует."

# PPG_Property_AssemblyName
source: Assembly Name
ru: Имя сборки

# PPG_Property_RootNamespace
source: Root Namespace
ru: Корневое пространство имен

# PPG_Property_StartupObject
source: Startup Object
ru: Автоматически запускаемый объект

# PPG_Property_ApplicationIcon
source: Application Icon
ru: Значок приложения

# PPG_Property_AssemblyVersion
source: Assembly Version
ru: Версия сборки

# PPG_Property_AssemblyFileVersion
source: Assembly File Version
ru: Версия файла сборки

# PPG_Property_AssemblyGuid
source: Assembly GUID
ru: GUID сборки

# PPG_Property_StartProgram
source: External Program Path
ru: Путь к внешней программе

# PPG_Property_StartURL
source: Start Browser With URL
ru: Запускать браузер, используя URL-адрес

# PPG_Property_StartWorkingDirectory
source: Working Directory
ru: Рабочий каталог

# PPG_Property_RemoteDebugMachine
source: Remote Machine Name
ru: Имя удаленного компьютера

# DFX_DesignerReadOnlyCaption
source: {0} [Read Only]
ru: {0} [только для чтения]

# DFX_DesignerLoaderIVsTextStreamNotFound
source: The editor could not get the IVsTextStream for file {0}.
ru: Редактору не удалось получить IVsTextStream для файла "{0}".

# DFX_DesignerLoaderIVsTextStreamNotFoundNoFile
source: The editor could not get the IVsTextStream.
ru: Редактору не удалось получить IVsTextStream.

# DFX_EditorNoDesignerService
source: No DesignerService for file '{0}'.
ru: Нет DesignerService для файла "{0}".

# DFX_UnableCreateTextBuffer
source: Unable to create text buffer.
ru: Невозможно создать текстовый буфер.

# DFX_NoLocalRegistry
source: No LocalRegistry service.
ru: Нет службы LocalRegistry.

# DFX_IncompatibleBuffer
source: File is already opened in an incompatible editor.
ru: Файл уже открыт в несовместимом редакторе.

# DFX_WindowPane_UnknownError
source: Unknown Error.
ru: Неизвестная ошибка.

# DFX_CreateEditorInstanceFailed_Ex
source: Unable to create the designer. {0}
ru: Невозможно создать конструктор. {0}

# DFX_UnableToCheckout
source: Unable to check out the current file. The file may be read-only or locked, or you may need to check the file out manually.
ru: Не удалось получить текущий файл для изменения. Возможно, файл доступен только для чтения или заблокирован, либо его следует получить вручную.

# PermissionSet_Requires
source: Requires:
ru: Требуется:

# RSE_ResourceNameColumn
source: Name
ru: Имя

# RSE_TypeColumn
source: Type
ru: Тип

# RSE_ResourceColumn
source: Value
ru: Значение

# RSE_CommentColumn
source: Comment
ru: Комментарий

# SD_ERR_HelpMessage_SuggestFileOpenWith
source: If this is not a Settings-Designer file then use 'Open With' to open it in a text editor.
ru: Если это не файл Settings-Designer, откройте его в текстовом редакторе с помощью команды "Открыть с помощью".

# SingleFileGenerator_FailedToGenerateFile_1Arg
source: Failed to generate file: {0}
ru: Не удалось создать файл: {0}

# RSE_Err_CantEditEmbeddedResource
source: Editing embedded resources directly is not supported. Do you wish to convert this item to a linked resource in order to edit it?
ru: Изменение внедренных ресурсов напрямую не поддерживается. Преобразовать этот элемент в связанный ресурс для его изменения?

# RSE_Err_RenameNotSupported
source: The current object is auto-generated and only supports renaming through the Managed Resources Editor.
ru: Текущий объект создан автоматически и поддерживает переименование только с помощью редактора управляемых ресурсов.

# RSE_Err_CantFindResourceFile_1Arg
source: Cannot find the file '{0}'. It may have been moved or deleted.
ru: Невозможно найти файл "{0}". Возможно, он был перемещен или удален.

# RSE_Err_LoadingResource_1Arg
source: Unable to load resource from file '{0}'.
ru: Не удается загрузить ресурс из файла "{0}".

# RSE_Err_NameBlank
source: The resource name cannot be empty.
ru: Имя ресурса не может быть пустым.

# RSE_Err_DuplicateName_1Arg
source: There is already another resource with the name '{0}'.
ru: Уже имеется другой ресурс с именем "{0}".

# RSE_Err_UnexpectedResourceType
source: The resource was not of the expected type.
ru: Непредвиденный тип ресурса

# RSE_Err_CantCreateNewResource_2Args
source: Unable to create new resource file '{0}'. {1}
ru: Не удается создать файл ресурсов "{0}". {1}

# RSE_Err_CantPlay_1Arg
source: Unable to play the audio resource. {0}
ru: Невозможно воспроизвести звуковой ресурс. {0}

# RSE_Err_CantSaveResource_1Arg
source: Resource '{0}' cannot be saved to a file.
ru: Ресурс "{0}" нельзя сохранить в файл.

# RSE_Err_UserCancel
source: The operation has been canceled by the user.
ru: Операция была прервана пользователем.

# RSE_Err_BadData
source: The resource value contains invalid data or has an incorrect format.
ru: Значение ресурса введено в неправильном формате или содержит недопустимые данные.

# RSE_Err_BadIdentifier_2Arg
source: The name of the resource '{0}' cannot be used as a valid identifier, because it contains one or more invalid characters: '{1}'. Please remove or replace those characters and try again.
ru: Имя ресурса "{0}" не может быть действительным идентификатором, так как оно содержит один или несколько недопустимых символов: "{1}". Удалите или замените эти символы и повторите попытку.

# RSE_Err_MaxFilesLimitation
source: Too many files specified. Please select fewer files and try again.
ru: Указано слишком много файлов. Выберите меньше файлов и повторите попытку.

# RSE_Err_InternalException
source: Unexpected error.
ru: Непредвиденная ошибка.

# RSE_Err_Unexpected_NoResource_1Arg
source: Unable to load internal localized resource '{0}'.
ru: Не удалось загрузить внутренний локализованный ресурс "{0}".

# RSE_Err_CantConvertFromString_2Args
source: The value could not be converted into a resource of type {0}. {1}
ru: Значение нельзя преобразовать в ресурс с типом "{0}". {1}

# RSE_Err_CantUseEmptyValue
source: The value cannot be empty in a resource of type {0}.
ru: Значение не может быть пустым в ресурсе типа {0}.

# RSE_Err_CantBeEmpty
source: One or more of the selected resource values could not be cleared.
ru: Не удалось очистить одно или несколько значений ресурса.

# RSE_Err_CantEditInDebugMode
source: The resource file cannot be modified at this time.
ru: В данный момент невозможно изменить файл ресурсов.

# RSE_Err_UpdateADependentFile
source: You are trying to edit a resource file that is a part of another project item (such as a form or a control). Editing this item could corrupt the project item, and you will have to recover it by hand. In addition, changes made to this resource file may be lost if further changes are made to the project item. Do you really want to edit this file?
ru: Вы пытаетесь изменить файл ресурса, являющийся частью другого элемента проекта (например, формы или элемента управления). Изменение этого элемента может повредить элемент проекта, и вам потребуется восстановить его вручную. Кроме того, изменения, внесенные в этот файл ресурса, могут быть утеряны при последующем изменении элемента проекта. Действительно изменить этот файл?

# RSE_Err_CantAddUnsupportedResource_1Arg
source: The resource '{0}' cannot be added.
ru: Невозможно добавить ресурс "{0}".

# RSE_Err_CantAddFileToDeviceProject_1Arg
source: The device does not support '{0}' files.
ru: Устройство не поддерживает файлы "{0}".

# RSE_Err_TypeIsNotSupported_1Arg
source: The resource item uses the type '{0}', which is not supported in this project.
ru: Для элемента ресурса используется тип "{0}", который не поддерживается в этом проекте.

# RSE_Err_CantSaveResouce_1Arg
source: The resource item(s) {0} cannot be saved correctly. The item(s) will be discarded.
ru: Невозможно правильно сохранить элементы ресурса "{0}". Элементы будут отменены.

# RSE_NothingValue
source: (Nothing/null)
ru: (Нет/null)

# RSE_UnknownType
source: (Unknown type)
ru: (Неизвестный тип)

# RSE_NonEditableValue
source: (Value cannot be displayed)
ru: (Значение невозможно вывести на экран)

# RSE_DetailsCol_Name
source: Name
ru: Имя

# RSE_DetailsCol_Filename
source: Filename
ru: Имя файла

# RSE_DetailsCol_ImageType
source: Type
ru: Тип

# RSE_DetailsCol_Size
source: Size
ru: Размер

# RSE_DetailsCol_Comment
source: Comment
ru: Комментарий

# RSE_FileSizeFormatKB
source: {0} KB
ru: {0} КБ

# RSE_FileSizeFormatBytes_1Arg
source: {0} byte(s)
ru: {0} байт

# RSE_Cat_Strings
source: Strings
ru: Строки

# RSE_Cat_Images
source: Images
ru: Изображения

# RSE_Cat_Icons
source: Icons
ru: Значки

# RSE_Cat_Audio
source: Audio
ru: Звук

# RSE_Cat_Files
source: Files
ru: Файлы

# RSE_Cat_Other
source: Other
ru: Другое

# RSE_Type_BMP
source: Windows Bitmap
ru: Точечный рисунок Windows

# RSE_Type_EXIF
source: EXIF Image
ru: Изображение EXIF

# RSE_Type_GIF
source: Graphics Interchange Format
ru: Формат GIF

# RSE_Type_JPEG
source: JPEG File Interchange Format
ru: Формат обмена файлами JPEG

# RSE_Type_MEMBMP
source: Windows Bitmap
ru: Точечный рисунок Windows

# RSE_Type_PNG
source: Portable Network Graphics
ru: Формат PNG

# RSE_Type_TIFF
source: Tag Image File Format
ru: Формат TIFF

# RSE_Type_Icon
source: Icon
ru: Значок

# RSE_Type_TextFile
source: Text File
ru: Текстовый файл

# RSE_Type_BinaryFile
source: Binary File
ru: Двоичный файл

# RSE_Type_Wave
source: Wave Sound
ru: Звукозапись

# RES_PersistenceMode_Linked
source: Linked at compile time
ru: Скомпоновано во время компиляции

# RES_PersistenceMode_Embeded
source: Embedded in .resx
ru: Внедрено в RESX-файл
