Repository: X-Sharp/XSharpPublic
Catalog: src/VisualStudio/SDKProjects/src/Microsoft.VisualStudio.Editors/Resources/xlf/Microsoft.VisualStudio.Editors.Designer.*.xlf
Languages: ru

# RSE_Filter_Bitmap
source: Bitmaps
ru: Точечные рисунки

# RSE_Filter_Icon
source: Icons
ru: Значки

# RSE_Filter_Audio
source: Audio
ru: Звук

# RSE_Filter_Text
source: Text Files
ru: Текстовые файлы

# RSE_Filter_All
source: All Files
ru: Все файлы

# RSE_FilterSave_BMP
source: Windows Bitmap
ru: Точечный рисунок Windows

# RSE_FilterSave_PNG
source: Portable Network Graphics
ru: Формат PNG

# RSE_FilterSave_GIF
source: Graphics Interchange Format
ru: Формат GIF

# RSE_FilterSave_JPEG
source: JPEG File Interchange Format
ru: Формат обмена файлами JPEG

# RSE_FilterSave_TIFF
source: Tag Image File Format
ru: Формат TIFF

# RSE_FilterSave_Icon
source: Icon
ru: Значок

# RSE_ResourceEditor
source: Managed Resources Editor
ru: Редактор управляемых ресурсов

# RSE_DlgTitle_AddExisting
source: Add existing file to resources
ru: Добавить существующий файл к ресурсам

# RSE_DlgTitle_Import_1Arg
source: Import file into resource '{0}'
ru: Импорт файла в ресурс "{0}"

# RSE_DlgTitle_Export_1Arg
source: Export resource '{0}' to file
ru: Экспорт ресурса "{0}" в файл

# RSE_DlgTitle_AddNew
source: Please specify where to save the new file
ru: Укажите, где следует сохранить новый файл

# RSE_Dlg_ReplaceExistingFile
source: The file '{0}' already exists. Do you want to replace it?
ru: Файл "{0}" уже существует. Заменить его?

# RSE_Dlg_ReplaceExistingFiles
source: The following files already exist. Do you want to replace them?
ru: Следующие файлы уже существуют. Заменить их?

# RSE_Dlg_ExportMultiple
source: Select a folder in which to export the resources.
ru: Выберите папку для экспорта ресурсов.

# RSE_Dlg_ContinueAnyway
source: Do you want to continue anyway?
ru: Все равно продолжить?

# RSE_Task_BadLink_2Args
source: Resource '{0}' could not be loaded because the file to which it is linked could not be found: {1}.
ru: Невозможно загрузить ресурс "{0}", так как не удалось обнаружить связанный с ним файл: {1}.

# RSE_Task_CantInstantiate_2Args
source: Resource '{0}' could not be instantiated. {1}
ru: Не удалось создать экземпляр ресурса "{0}". {1}

# RSE_Task_NonrecommendedName_1Arg
source: Resource '{0}' has a name that is not recommended and that may cause compilation errors in your code. Please choose another name.
ru: Ресурс "{0}" имеет имя, которое не рекомендуется использовать, так как оно может вызвать ошибки компиляции в вашем коде. Выберите другое имя.

# RSE_Task_CantChangeCustomToolOrNamespace
source: Unable to set the Custom Tool or Custom Tool Namespace properties of this file in order to change strongly-typed resource generation options. If the project file is checked in, try checking it out.
ru: Не удалось задать свойства "Пользовательский инструмент" и "Пространство имен пользовательского инструмента" для этого файла. Они необходимы для изменения параметров создания для ресурса со строгой типизацией. Если файл проекта возвращен, попытайтесь получить его для изменения.

# RSE_Task_InvalidName_1Arg
source: The resource name '{0}' is not a valid identifier.
ru: Имя ресурса "{0}" не является допустимым идентификатором.

# RSE_EncodingDisplayName
source: {0} - Codepage {1}
ru: {0} — кодовая страница {1}

# RSE_DefaultEncoding
source: (Default)
ru: (По умолчанию)

# RSE_Undo_ChangeName
source: Change resource name
ru: Изменить имя ресурса

# RSE_Undo_AddResources_1Arg
source: Add {0} new resource(s)
ru: Добавление новых ресурсов: {0}

# RSE_Undo_RemoveResources_1Arg
source: Remove {0} resource(s)
ru: Удаление ресурсов: {0}

# RSE_Undo_DeleteResourceCell
source: Delete values in {0} cell(s)
ru: Удаление значений в нескольких ячейках: {0}

# RSE_PropDesc_Name
source: Name used to identify the resource in code.
ru: Имя, используемое для идентификации ресурса в коде.

# RSE_PropDesc_Comment
source: Additional information about the resource. This property is only meaningful at design time.
ru: Дополнительные сведения о ресурсе. Это свойство имеет значение только во время разработки.

# RSE_PropDesc_Encoding
source: Character encoding of the file.
ru: Кодировка знаков файла.

# RSE_PropDesc_Filename
source: The path to the linked resource.
ru: Путь к связанному ресурсу.

# RSE_PropDesc_FileType
source: Specifies whether the file resource is text or binary.
ru: Указывает, является ли файловый ресурс текстовым или двоичным.

# RSE_PropDesc_Persistence
source: Specifies whether the resource is embedded or linked. Embedded resources are saved in the resource file. Linked resources reside in an external location on disk.
ru: Указывает, является ли ресурс внедренным или связанным. Внедренные ресурсы сохраняются в файле ресурсов. Связанные ресурсы хранятся на диске во внешних папках.

# RSE_PropDesc_Type
source: The resource will be generated as this type in the strongly-typed resource class. For example, the resource might be generated as a String or Bitmap object.
ru: Ресурс будет создан как данный тип в классе ресурсов строго заданного типа. Например, ресурс может быть создан как объект "Строка" или "Точечный рисунок".

# RSE_PropDesc_Value
source: The value of the resource.
ru: Значение ресурса.

# RFS_CantCreateResourcesFolder_Folder_ExMsg
source: Unable to add a '{0}' folder to this project. {1}
ru: Не удается добавить папку "{0}" в этот проект. {1}

# RFS_CantAddFileToProject_File_ExMsg
source: Unable to add '{0}' to the project. {1}
ru: Не удается добавить "{0}" в проект. {1}

# RFS_CantAddFileToProject_File
source: Unable to add '{0}' to the project.
ru: Не удается добавить "{0}" в проект.

# RFS_QueryReplaceFile_File
source: A file with the name '{0}' already exists. Do you want to replace it?
ru: Файл с именем "{0}" уже существует. Заменить его?

# RFS_QueryReplaceFileTitle_Editor
source: {0} - Destination File Exists
ru: {0} — файл назначения существует

# RFS_QueryRemoveLink_Folder_Link
source: There is already a linked file with the name "{0}" in the project folder "{1}". Do you want to remove it?
ru: Связанный файл с именем "{0}" уже существует в папке "{1}" проекта. Удалить его?

# RFS_QueryRemoveLinkTitle_Editor
source: {0} - Destination File Exists
ru: {0} — файл назначения существует

# RFS_FindNotFound_File
source: Cannot find the file '{0}'. It may have been moved or deleted.
ru: Невозможно найти файл "{0}". Возможно, он был перемещен или удален.

# SD_ComboBoxItem_ConnectionStringType
source: Connection string
ru: Строка подключения

# SD_ComboBoxItem_WebReferenceType
source: Web Service URL
ru: URL-адрес веб-службы

# SD_ComboBoxItem_BrowseType
source: Browse...
ru: Обзор...

# SD_ComboBoxItem_ApplicationScope
source: Application
ru: Приложение

# SD_ComboBoxItem_WebApplicationScope
source: Application (Web)
ru: Приложение (веб)

# SD_ComboBoxItem_UserScope
source: User
ru: Пользователь

# SD_ComboBoxItem_WebUserScope
source: User (Web)
ru: Пользователь (веб)

# SD_GridViewNameColumnHeaderText
source: Name
ru: Имя

# SD_GridViewTypeColumnHeaderText
source: Type
ru: Тип

# SD_GridViewScopeColumnHeaderText
source: Scope
ru: Область.

# SD_GridViewValueColumnHeaderText
source: Value
ru: Значение

# SD_UnknownType
source: Type '{0}' is not defined.
ru: Тип "{0}" не определен.

# SD_UndoTran_NameChanged
source: Name changed
ru: Имя изменено

# SD_UndoTran_TypeChanged
source: Type changed
ru: Тип изменен

# SD_UndoTran_ScopeChanged
source: Scope changed
ru: Область изменена

# SD_UndoTran_RoamingChanged
source: Roaming changed
ru: Роуминг изменен

# SD_UndoTran_DescriptionChanged
source: Description changed
ru: Описание изменено

# SD_UndoTran_ProviderChanged
source: Provider changed
ru: Поставщик изменен

# SD_UndoTran_SerializedValueChanged
source: Value changed
ru: Значение изменено

# SD_UndoTran_GenerateDefaultValueInCode
source: Generate default value in code changed
ru: Создание значения по умолчанию в коде изменилось

# SD_UndoTran_RemoveMultipleSettings_1Arg
source: Remove {0} setting(s)
ru: Удаление параметров: {0}

# SD_Err_CantLoadSettingsFile
source: Unable to load settings file. It might be corrupted or contain invalid XML or contain duplicate identifiers.
ru: Не удается загрузить файл параметров. Возможно, он поврежден, содержит недопустимый XML-код или повторяющиеся идентификаторы.

# SD_NewValuesAdded
source: New values from the app.config file were automatically added
ru: Автоматически добавлены новые значения из файла app.config

# SD_ReplaceValueWithAppConfigValueTitle
source: Value of setting '{0}' was changed in the app.config file.
ru: Значение параметра "{0}" изменилось в файле app.config.

# SD_ReplaceValueWithAppConfigValue
source: The current value in the .settings file is '{0}' The new value in the app.config file is '{1}' Do you want to update the value in the .settings file?
ru: Текущее значение в файле параметров — "{0}" Новое значение в файле app.config — "{1}" Изменить это значение в файле параметров?

# SD_FailedToLoadAppConfigValues
source: An error occurred while reading the app.config file. The file might be corrupted or contain invalid XML.
ru: При чтении файла app.config произошла ошибка. Возможно, файл поврежден или содержит недопустимый XML-код.

# SD_FailedToSaveAppConfigValues
source: An error occurred while saving values to the app.config file. The file might be corrupted or contain invalid XML.
ru: При сохранении значений в файл app.config произошла ошибка. Возможно, файл поврежден или содержит недопустимый XML-код.

# SD_ERR_DuplicateName_1Arg
source: There is already another setting with the name '{0}'.
ru: Уже имеется другой параметр с именем "{0}".

# SD_ERR_InvalidIdentifier_1Arg
source: '{0}' is not a valid identifier.
ru: "{0}" не является допустимым идентификатором.

# SD_ERR_InvalidTypeName_1Arg
source: '{0}' is not a valid type name.
ru: "{0}" не является допустимым именем типа.

# SD_ERR_NameEmpty
source: The setting name cannot be empty.
ru: Имя параметра не может быть пустым.

# SD_ERR_InvalidValue_2Arg
source: '{0}' cannot be converted to an instance of type '{1}'.
ru: Невозможно преобразовать "{0}" в экземпляр типа "{1}".

# SD_ERR_GenericTypesNotSupported_1Arg
source: Generic types are not supported.
ru: Универсальные типы не поддерживаются.

# SD_ERR_AbstractTypesNotSupported_1Arg
source: Abstract types are not supported.
ru: Абстрактные типы не поддерживаются.

# SD_ERR_RenameNotSupported
source: The current object is auto-generated and only supports renaming through the Settings Designer.
ru: Текущий объект создан автоматически и поддерживает переименование только с помощью конструктора параметров.

# SD_ERR_ModifyParamsNotSupported
source: The current object is auto-generated and does not support modifying parameters.
ru: Текущий объект создан автоматически и не поддерживает изменение параметров.

# SD_ERR_CantEditInDebugMode
source: The settings file cannot be modified at this time.
ru: В данный момент невозможно изменить файл параметров.

# SD_MNU_AddSettingText
source: &Add Setting
ru: &Добавить параметр

# SD_MNU_RemoveSettingText
source: R&emove Setting
ru: У&далить параметр

# SD_FullDescriptionText
source: Application settings allow you to store and retrieve property settings and other information for your application dynamically. For example, the application can save a user's color preferences, then retrieve them the next time it runs.
ru: Параметры приложения позволяют динамически сохранять и извлекать параметры свойств и другие данные для приложения. Например, приложение может сохранять пользовательские параметры цветов и извлекать их при следующем запуске.

# SD_LinkPartOfDescriptionText
source: Learn more about application settings...
ru: Дополнительные сведения о параметрах приложений...

# SD_IncludeSensitiveInfoInConnectionStringWarning
source: This connection string appears to contain sensitive data (for example, a password), which is required to connect to the database. However, storing sensitive data in the connection string can be a security risk. Do you want to include sensitive data in the connection string?
ru: Возможно, эта строка подключения содержит конфиденциальные данные (например, пароль), необходимые для подключения к базе данных. Хранение таких данных в строке подключения представляет потенциальную угрозу безопасности. Действительно включить конфиденциальные данные в строку подключения?

# SD_SelectATypeTreeView_AccessibleName
source: Select a Type
ru: Выбор типа

# SD_CODEGENCMT_COMMON1
source: This class allows you to handle specific events on the settings class:
ru: Этот класс позволяет обрабатывать определенные события в классе параметров:

# SD_CODEGENCMT_COMMON2
source: The SettingChanging event is raised before a setting's value is changed.
ru: Событие SettingChanging возникает перед изменением значения параметра.

# SD_CODEGENCMT_COMMON3
source: The PropertyChanged event is raised after a setting's value is changed.
ru: Событие PropertyChanged возникает после изменения значения параметра.

# SD_CODEGENCMT_COMMON4
source: The SettingsLoaded event is raised after the setting values are loaded.
ru: Событие SettingsLoaded возникает после загрузки значений параметров.

# SD_CODEGENCMT_COMMON5
source: The SettingsSaving event is raised before the setting values are saved.
ru: Событие SettingsSaving возникает перед сохранением значений параметров.

# SD_CODEGENCMT_HOWTO_ATTACHEVTS
source: To add event handlers for saving and changing settings, uncomment the lines below:
ru: Для добавления обработчиков событий для сохранения и изменения параметров раскомментируйте приведенные ниже строки:

# SD_CODEGENCMT_HANDLE_CHANGING
source: Add code to handle the SettingChangingEvent event here.
ru: Добавьте здесь код для обработки события SettingChangingEvent.

# SD_CODEGENCMT_HANDLE_SAVING
source: Add code to handle the SettingsSaving event here.
ru: Добавьте здесь код для обработки события SettingsSaving.

# SD_CODEGEN_FAILEDOPENCREATEEXTENDINGFILE
source: Failed to create or open file.
ru: Не удалось создать или открыть файл.

# SD_DESCR_Description
source: Description of the setting.
ru: Описание параметра.

# SD_DESCR_GenerateDefaultValueInCode
source: Specifies whether or not the default setting value should be generated in the strongly-typed settings class.
ru: Определяет необходимость создания используемого по умолчанию значения параметра в классе параметров строго заданного типа.

# SD_DESCR_Roaming
source: Indicates whether the setting should roam when Windows roaming profiles are enabled.
ru: Указывает, должен ли перемещаться этот параметр, если включены перемещаемые профили Windows.

# SD_DESCR_Name
source: Name used to identify the setting.
ru: Имя, используемое для идентификации параметра.

# SD_DESCR_Provider
source: The provider (System.Configuration.Provider.ProviderBase) used to manage the setting.
ru: Поставщик (System.Configuration.Provider.ProviderBase) используется для управления параметром.

# SD_DESCR_Scope
source: Specifies whether the setting is per-application (read-only) or per-user (read-write).
ru: Указывает, относится этот параметр к приложению (только чтение) или к пользователю (чтение и запись).

# SD_DESCR_SerializedSettingType
source: The setting will be generated as this type in the strongly-typed settings class. For example, the setting might be generated as a String or Integer object.
ru: Параметр будет создан как данный тип в классе параметров строго заданного типа. Например, параметр может быть создан как объект "Строка" или "Целое число".

# SD_DESCR_Value
source: The current value for the setting.
ru: Текущее значение для параметра.

# SD_SyncFiles_1Arg
source: The following files will be deleted: {0}
ru: Будут удалены следующие файлы: {0}

# SD_SyncFilesNoFilesFound_1Arg
source: No user.config files were found in any of the following locations: {0}
ru: Файлы user.config не обнаружены в следующих расположениях: {0}

# SD_SyncFilesOneOrMoreFailed
source: One or more user.config files was not removed.
ru: Один или несколько файлов user.config не были удалены.

# SD_SFG_AutoSaveRegionText
source: My.Settings Auto-Save Functionality
ru: Функция автоматического сохранения My.Settings

# General_MissingService
source: Unable to find service '{0}'. Ensure that the application is installed correctly.
ru: Не удается найти службу "{0}". Убедитесь, что приложение установлено правильно.

# RSE_AccessModifier_Custom
source: (Custom)
ru: (Настраиваемое)

# RSE_NoCodeGeneration
source: No code generation
ru: Без создания кода

# PPG_WindowsApp_WPF
source: WPF Application
ru: Приложение WPF

# PPG_WPFApp_InvalidShutdownMode
source: (Invalid value: "{0}")
ru: (Недопустимое значение: "{0}")

# PPG_WPFApp_ShutdownMode_OnExplicitShutdown
source: On explicit shutdown
ru: При явном завершении работы

# PPG_WPFApp_ShutdownMode_OnLastWindowClose
source: On last window close
ru: При закрытии последнего окна

# PPG_WPFApp_ShutdownMode_OnMainWindowClose
source: On main window close
ru: При закрытии главного окна

# PPG_WPFApp_Xaml_CouldntFindRootElement
source: Could not find the expected root element "{0}" in the application definition file.
ru: Не удалось найти ожидаемый корневой элемент "{0}" в файле определения приложения.

# PPG_WPFApp_Xaml_UnexpectedFormat_2Args
source: The .xaml file was in an unexpected format, near line {0} column {1}.
ru: Непредвиденный формат XAML-файла; см. строку {0}, столбец {1}.

# PPG_Application_StartupObjectLabelText
source: Startup &object:
ru: Объект &запуска:

# PPG_Application_StartupUriLabelText
source: Startup &URI:
ru: URI &запуска:

# PPG_WPFApp_AppXamlOpenInUnsupportedEditor
source: The application definition file is already opened in an incompatible editor. Please close the other editor and reload the project properties page.
ru: Файл определения приложения уже открыт в несовместимом редакторе. Закройте другой редактор и перезагрузите страницу свойств проекта.

# PPG_WPFApp_CantOpenOrCreateAppXaml_1Arg
source: There was an error trying to open or create the application definition file for this project. {0}
ru: При попытке открытия или создания файла определения приложения произошла ошибка. {0}

# PPG_WPFApp_ErrorControlMessage_1Arg
source: An error occurred trying to load the application definition file for this project. The file '{0}' could not be parsed. Please edit the file in the XAML editor to fix the error.
ru: При попытке загрузки файла определения приложения для этого проекта произошла ошибка. Не удалось проанализировать файл "{0}". Чтобы исправить ошибку, измените файл в редакторе XAML.

# PPG_Unexpected
source: An unspecified error has occurred.
ru: Произошла неопределенная ошибка.

# PPG_WPFApp_CantFindAppXaml
source: This project does not contain an application definition file.
ru: Проект не содержит файл определения приложения.

# PPG_WPFApp_CouldntCreateApplicationEventsFile_1Arg
source: An error occurred trying to create the application events file. {0}
ru: При попытке создания файла событий приложения произошла ошибка. {0}

# General_InvalidArgument_1Arg
source: Invalid argument '{0}'
ru: Недопустимый аргумент "{0}"

# PPG_CommandLineApp_WPF
source: WPF Console Application
ru: Консольное приложение WPF

# PPG_WindowsClassLib_WPF
source: WPF Class Library
ru: Библиотека классов WPF

# PPG_Application_DefaultManifestText
source: Embed manifest with default settings
ru: Внедрить манифест с настройками по умолчанию

# PPG_Application_NoManifestText
source: Create application without a manifest
ru: Создать приложение без манифеста

# PPG_Application_BadManifest
source: Invalid manifest file.
ru: Недопустимый файл манифеста.

# PPG_Services
source: Services
ru: Службы

# PPG_Services_HelpLabelText
source: Client application services enable your Windows-based applications to use the ASP.NET login (authentication), roles, and profile (settings) services. To enable client application services, you must set the Target Framework for your application to the full version of the .NET Framework 3.5 or later.
ru: Службы клиентских приложений позволяют использовать в Windows приложениях службы ASP.NET входа (аутентификации), ролей и профиля (настроек). Чтобы обеспечить работу клиентских служб, необходимо задать в качестве целевой платформы приложения полную версию .NET Framework 3.5 или более позднюю версию.

# PPG_Services_HelpLabelLink
source: Learn more about client application services...
ru: Дополнительные сведения о службах клиентских приложений...

# PPG_ServicesAdvancedPage_Title
source: Advanced Settings for Services
ru: Дополнительные параметры для служб

# PPG_Services_ConfirmRemoveServices
source: Disabling application services will clear the default services for Authentication, Roles, and Settings. Click OK to disable application services.
ru: Отключение служб приложений очистит службы по умолчанию для проверки подлинности, ролей и параметров. Нажмите кнопку ОК для отключения служб приложений.

# PPG_Services_ConfirmRemoveServices_Caption
source: Disable Application Services
ru: Отключить службы приложений

# PPG_Services_Seconds
source: seconds
ru: с

# PPG_Services_Minutes
source: minutes
ru: мин

# PPG_Services_Hours
source: hours
ru: ч

# PPG_Services_Days
source: days
ru: дн.

# PPG_Services_VersionWarning
source: To enable client application services, you must set the Target Framework for your application to .NET Framework 3.5 or later. In C#, you can do this on the Application property page. In Visual Basic, you can do this on the Compile property page by clicking Advanced Compile Options.
ru: Чтобы обеспечить работу клиентских служб, необходимо задать в качестве целевой платформы приложения .NET Framework 3.5 или более позднюю версию. В C# это можно сделать на странице свойств приложения. В Visual Basic это можно сделать на странице свойств компиляции, щелкнув "Дополнительные параметры компиляции".

# PPG_Services_InvalidAppConfigXml
source: An error occurred while reading the Application configuration file. The file might be corrupted or contain invalid XML.
ru: Произошла ошибка при чтении конфигурационного файла приложения. Возможно, файл поврежден или содержит недопустимый XML-код.

# PPG_Services_InvalidUrl
source: The URL is invalid. Please enter a valid URL like http://microsoft.com/services
ru: URL-адрес недопустим. Введите допустимый URL-адрес, например http://microsoft.com/services.

# PPG_Services_InvalidUrls
source: A service URL in the application configuration file is not in the expected format.
ru: URL службы, записанный в конфигурационном файле приложения записан в недопустимом формате.

# PPG_Services_ConnectionStringsDontMatch
source: Authentication, Roles and Web Settings providers have been configured via the Application configuration file such that they do not share a common connection string.
ru: Поставщики для аутентификации, ролей и веб-параметров сконфигурированы файлом конфигурации приложения таким образом, что они не разделяют общей строки подключения.

# PPG_Services_connectionStringValueDefaultDisplayValue
source: Specify a connection string to a SQL Server database, or use the special connection string "Data Source = |SQL/CE|", which causes SQL Server Compact to generate local database files for offline storage.
ru: Укажите строку подключения к базе данных SQL Server. Либо используйте специальную строку подключения "Data Source = |SQL/CE|". В этом случае SQL Server Compact создаст локальную базу данных для хранения вне сети.

# SD_ERR_UnreferencedTypeNameList_1Arg
source: The following type names were not understood: '{0}'. Make sure you have references to these types.
ru: Следующие имена типов не распознаны: "{0}". Убедитесь, что существуют ссылки на эти типы.

# SD_ERR_DuplicateNameList_1Arg
source: There are already settings with the following names: {0}.
ru: Уже есть параметры со следующими именами: {0}.
