Repository: X-Sharp/XSharpPublic
Catalog: src/VisualStudio/SDKProjects/src/Microsoft.VisualStudio.Editors/Resources/xlf/MyExtensibilityRes.*.xlf
Languages: cs, es, it, ko, pl, ru, zh_hans

# AssemblyOptionDialog_Add_Question
source: The following My Namespace extensions are associated with assembly '{0}'. Do you want to add them to your project?
cs: Následující rozšíření rozhraní My Namespace jsou přidružená k sestavení {0}. Chcete je přidat do projektu?
es: Las siguientes extensiones del espacio de nombres My están asociadas con el ensamblado '{0}'. ¿Quiere agregarlas al proyecto?
it: Le estensioni seguenti dello spazio dei nomi My sono associate all'assembly '{0}'. Aggiungerle al progetto?
ko: 다음 My 네임스페이스 확장이 '{0}' 어셈블리에 연결되어 있습니다. 이러한 확장을 프로젝트에 추가하시겠습니까?
pl: Następujące rozszerzenia typu My Namespace są skojarzone z zestawem „{0}”. Czy chcesz je dodać do projektu?
ru: Следующие расширения пространства имен My связаны со сборкой "{0}". Добавить их в проект?
zh_hans: 下面的 My 命名空间扩展与程序集“{0}”关联。是否将它们添加到项目中?

# AssemblyOptionDialog_Add_Text
source: Add My Namespace Extensions
cs: Přidat rozšíření My Namespace
es: Agregar extensiones del espacio de nombres My
it: Aggiungi estensioni spazio dei nomi My
ko: My 네임스페이스 확장 추가
pl: Dodaj rozszerzenia typu My Namespace
ru: Добавить расширения пространства имен My
zh_hans: 添加 My 命名空间扩展

# AssemblyOptionDialog_Option
source: &Remember my decision for '{0}'.
cs: Pamatovat si &rozhodnutí pro {0}.
es: &Recordar esta decisión para '{0}'.
it: &Memorizza impostazione per '{0}'.
ko: '{0}'에 대한 결정을 저장합니다(&R).
pl: &Zapamiętaj mój wybór dla „{0}”.
ru: &Запомнить мое решение для "{0}".
zh_hans: 记住我对“{0}”的决定(&R)。

# AssemblyOptionDialog_Remove_Question
source: Removing the reference to '{0}' will make the following My Namespace extensions stop functioning. Do you want to remove them as well?
cs: Pokud odeberete odkaz na {0}, přestanou následující rozšíření My Namespace fungovat. Chcete je také odebrat?
es: Si quita la referencia a '{0}', las siguientes extensiones del espacio de nombres My dejarán de funcionar. ¿Quiere quitarlas también?
it: Se si rimuove il riferimento a '{0}', le estensioni dello spazio dei nomi My non funzioneranno più. Rimuovere anche le estensioni?
ko: '{0}'에 대한 참조를 제거하면 다음 My 네임스페이스 확장의 작동이 중지됩니다. 확장도 제거하시겠습니까?
pl: Usunięcie odwołania do elementu „{0}” spowoduje, że następujące rozszerzenia typu My Namespace przestaną działać. Czy chcesz je również usunąć?
ru: Удаление ссылки на "{0}" приведет к тому, что следующие расширения пространства имен My прекратят функционировать. Удалить их тоже?
zh_hans: 删除对“{0}”的引用会导致以下 My 命名空间扩展停止工作。是否仍要删除它们?

# AssemblyOptionDialog_Remove_Text
source: Remove My Namespace Extensions
cs: Odebrat rozšíření My Namespace
es: Quitar extensiones del espacio de nombres My
it: Rimuovi estensioni spazio dei nomi My
ko: My 네임스페이스 확장 제거
pl: Usuń rozszerzenia typu My Namespace
ru: Удалить расширения пространства имен My
zh_hans: 删除 My 命名空间扩展

# CouldNotAddProjectItemTemplate_Message
source: No project items were added to the current project from My Namespace extension '{0}'. The extension will not be added to the project.
cs: Z rozšíření My Namespace {0} se do aktuálního projektu nepřidaly žádné položky projektu. Rozšíření nebude do projektu přidáno.
es: No se han agregado elementos de proyecto al proyecto actual de la extensión '{0}' del espacio de nombres My. No se agregará la extensión al proyecto.
it: Non è stato possibile aggiungere elementi del progetto al progetto corrente dall'estensione '{0}' dello spazio dei nomi My. L'estensione non verrà aggiunta al progetto.
ko: My 네임스페이스 확장 '{0}'에서 현재 프로젝트에 추가된 프로젝트 항목이 없습니다. 프로젝트에 확장이 추가되지 않습니다.
pl: Nie dodano żadnych elementów z rozszerzenia typu My Namespace „{0}” do bieżącego projektu. Rozszerzenie nie zostanie dodane do projektu.
ru: Из расширения пространства имен My "{0}" в текущий проект не было добавлено ни одного элемента. Расширение не будет добавлено в проект.
zh_hans: 未从 My 命名空间扩展“{0}”向当前项目添加任何项目项。该扩展不会添加到项目中。

# CouldNotAddProjectItemTemplate_Title
source: Failed to Add Project Item
cs: Selhalo přidání položky projektu
es: No se pudo agregar el elemento de proyecto
it: Non è stato possibile aggiungere l'elemento del progetto
ko: 프로젝트 항목 추가 실패
pl: Dodanie elementu projektu nie powiodło się
ru: Произошла ошибка при добавлении элемента проекта
zh_hans: 未能添加项目项

# CouldNotSetExtensionAttributes_AllItems
source: No project items could be associated with My Namespace extension '{0}'. The extension will not be added to the project.
cs: Rozšíření My Namespace {0} nemá přidružené žádné položky projektu. Rozšíření nebude do projektu přidáno.
es: No se pueden asociar elementos de proyecto con la extensión '{0}' del espacio de nombres My. No se agregará la extensión al proyecto.
it: Non è stato possibile associare elementi del progetto all'estensione '{0}' dello spazio dei nomi My. L'estensione non verrà aggiunta al progetto.
ko: 프로젝트 항목을 My 네임스페이스 확장 '{0}'과(와) 연결할 수 없습니다. 프로젝트에 확장이 추가되지 않습니다.
pl: Nie można powiązać żadnych elementów projektu z rozszerzeniem typu My Namespace „{0}”. Rozszerzenie nie zostanie dodane do projektu.
ru: Нет элементов проекта, которые можно связать с расширением пространства имен My "{0}". Расширение не будет добавлено в проект.
zh_hans: 没有任何项目项能够与 My 命名空间扩展“{0}”关联。该扩展不会添加到项目中。

# CouldNotSetExtensionAttributes_Message
source: Project item '{0}' was added to the current project but could not be associated with My Namespace extension '{1}'. It will not be removed with the extension.
cs: Položka projektu {0} byla přidána do aktuálního projektu, ale nemůžete ji přidružit k rozšíření My Namespace {1}. S rozšířením nebude odebrána.
es: Se ha agregado el elemento de proyecto '{0}' al proyecto actual, pero no se puede asociar a la extensión '{1}' del espacio de nombres My. No se quitará con la extensión.
it: L'elemento '{0}' del progetto è stato aggiunto al progetto corrente, ma non può essere associato all'estensione '{1}' dello spazio dei nomi My. L'elemento non verrà rimosso con l'estensione.
ko: 프로젝트 항목 '{0}'이(가) 현재 프로젝트에 추가되었지만 My 네임스페이스 확장 '{1}'과(와) 연결할 수 없습니다. 확장과 함께 제거되지 않습니다.
pl: Dodano element „{0}” do bieżącego projektu, ale nie można go powiązać z rozszerzeniem typu My Namespace „{1}”. Element ten nie zostanie usunięty z tym rozszerzeniem.
ru: Элемент проекта "{0}" был добавлен в текущий проект. Однако он не может быть связан с расширением пространства имен My "{1}". Он не будет удален вместе с расширением.
zh_hans: 项目项“{0}”已添加到当前项目，但未能与 My 命名空间扩展“{1}”关联。它不会与此扩展一起被删除。

# CouldNotSetExtensionAttributes_Title
source: Failed to Set Extension Attributes
cs: Selhalo nastavení rozšiřujících atributů
es: No se pudieron establecer atributos de extensión
it: Non è stato possibile impostare gli attributi dell'estensione
ko: 확장 특성 설정 실패
pl: Ustawienie atrybutów rozszerzenia nie powiodło się
ru: Произошла ошибка при установке атрибутов расширения
zh_hans: 未能设置扩展特性

# ExtensionExists_Message
source: Version '{0}' of My Namespace extension '{1}' already exists in the current project. Do you want to overwrite it with version '{2}'?
cs: Verze {0} rozšíření My Namespace {1} už v aktuálním projektu existuje. Chcete ji přepsat verzí {2}?
es: La versión '{0}' de la extensión '{1}' del espacio de nombres My ya existe en el proyecto actual. ¿Quiere sobrescribirla con la versión '{2}'?
it: La versione '{0}' dell'estensione dello spazio dei nomi My '{1}' esiste già nel progetto corrente. Sovrascriverla con la versione '{2}'?
ko: My 네임스페이스 확장 '{1}'의 버전 '{0}'이(가) 이미 현재 프로젝트에 있습니다. 버전 '{2}'(으)로 덮어쓰시겠습니까?
pl: W bieżącym projekcie istnieje już wersja „{0}” rozszerzenia typu My Namespace „{1}”. Czy chcesz ją zastąpić wersją „{2}”?
ru: Версия "{0}" расширения пространства имен My "{1}" уже существует в текущем проекте. Перезаписать ее версией "{2}"?
zh_hans: 当前项目中已经存在 My 命名空间扩展“{1}”的版本“{0}”。是否用版本“{2}”覆盖它?

# ExtensionExists_Title
source: Extension File Already Exists
cs: Soubor rozšíření už existuje
es: El archivo de extensión ya existe
it: File di estensione già esistente
ko: 확장 파일 이미 있음
pl: Plik rozszerzenia już istnieje
ru: Файл расширения уже существует
zh_hans: 扩展文件已存在

# PropertyPageTab
source: My Extensions
cs: Moje rozšíření
es: Extensiones de My
it: Estensioni My
ko: My 확장
pl: Moje rozszerzenia
ru: Расширения My
zh_hans: 我的扩展

# StatusBar_Add_Finish
source: My Namespace extensions added: '{0}'.
cs: Rozšíření My Namespace byla přidána: {0}
es: Extensiones del espacio de nombres My agregadas: '{0}'.
it: Estensioni dello spazio dei nomi My aggiunte: '{0}'.
ko: My 네임스페이스 확장이 추가되었습니다. '{0}'.
pl: Dodane rozszerzenia typu My Namespace: „{0}”.
ru: Добавлены расширения пространства имен My: "{0}".
zh_hans: 已添加 My 命名空间扩展“{0}”。

# StatusBar_Add_Progress
source: My Namespace extension added: '{0}'.
cs: Rozšíření My Namespace bylo přidáno: {0}
es: Extensión del espacio de nombres My agregada: '{0}'.
it: Estensione dello spazio dei nomi My aggiunta: '{0}'.
ko: My 네임스페이스 확장이 추가되었습니다. '{0}'.
pl: Dodane rozszerzenie typu My Namespace: „{0}”.
ru: Добавлено расширение пространства имен My: "{0}".
zh_hans: 已添加 My 命名空间扩展“{0}”。

# StatusBar_Add_Remove_Finish
source: My Namespace extensions added: '{0}'. My Namespace extensions removed: '{1}'.
cs: Rozšíření My Namespace byla přidána: {0} Rozšíření My Namespace byla odebrána: {1}
es: Extensiones del espacio de nombres My agregadas: '{0}'. Extensiones del espacio de nombres My quitadas: '{1}'.
it: Estensioni dello spazio dei nomi My aggiunte: '{0}'. Estensioni dello spazio dei nomi My rimosse: '{1}'.
ko: My 네임스페이스 확장이 추가되었습니다. '{0}'. My 네임스페이스 확장이 제거되었습니다. '{1}'.
pl: Dodane rozszerzenia typu My Namespace: „{0}”. Usunięte rozszerzenia typu My Namespace: „{1}”.
ru: Добавлены расширения пространства имен My: "{0}". Удалены расширения пространства имен My: "{1}".
zh_hans: 已添加 My 命名空间扩展“{0}”。已删除 My 命名空间扩展“{1}”。

# StatusBar_Add_Start
source: Adding My Namespace extensions...
cs: Přidává se rozšíření My Namespace...
es: Agregando extensiones del espacio de nombres My...
it: Aggiunta delle estensioni dello spazio dei nomi My...
ko: My 네임스페이스 확장을 추가하고 있습니다...
pl: Dodawanie rozszerzeń typu My Namespace...
ru: Добавление расширений пространства имен My...
zh_hans: 正在添加 My 命名空间扩展...

# StatusBar_Remove_Finish
source: My Namespace extensions removed: '{0}'.
cs: Rozšíření My Namespace byla odebrána: {0}
es: Extensiones del espacio de nombres My quitadas: '{0}'.
it: Estensioni dello spazio dei nomi My rimosse: '{0}'.
ko: My 네임스페이스 확장이 제거되었습니다. '{0}'.
pl: Usunięte rozszerzenia typu My Namespace: „{0}”.
ru: Удалены расширения пространства имен My: "{0}".
zh_hans: 已删除 My 命名空间扩展“{0}”。

# StatusBar_Remove_Progress
source: My Namespace extension removed: '{0}'.
cs: Rozšíření My Namespace bylo odebráno: {0}
es: Extensión del espacio de nombres My quitada: '{0}'.
it: Estensione dello spazio dei nomi My rimossa: '{0}'.
ko: My 네임스페이스 확장이 제거되었습니다. '{0}'.
pl: Usunięte rozszerzenie typu My Namespace: „{0}”.
ru: Удалено расширение пространства имен My: "{0}".
zh_hans: 已删除 My 命名空间扩展“{0}”。

# StatusBar_Remove_Start
source: Removing My Namespace extensions...
cs: Odebírá se rozšíření My Namespace...
es: Quitando extensiones del espacio de nombres My...
it: Rimozione delle estensioni dello spazio dei nomi My...
ko: My 네임스페이스 확장을 제거하고 있습니다...
pl: Usuwanie rozszerzeń typu My Namespace...
ru: Удаление расширений пространства имен My...
zh_hans: 正在删除 My 命名空间扩展...
