Repository: X-Sharp/XSharpPublic
Catalog: src/VisualStudio/SDKProjects/src/Microsoft.VisualStudio.ProjectSystem.Managed/ProjectSystem/Rules/Dependencies/xlf/SdkReference.xaml.*.xlf
Languages: pl, pt_br, ru

# Rule|SdkReference|DisplayName
source: SDK Reference
pl: Odwołanie SDK
pt_br: Referência do SDK
ru: Ссылка на пакет SDK

# Rule|SdkReference|Description
source: SDK Reference Properties
pl: Właściwości odwołania SDK
pt_br: Propriedades da Referência do SDK
ru: Свойства ссылки на пакет SDK

# StringProperty|SDKRootFolder|DisplayName
source: SDK Root
pl: Główny zestaw SDK
pt_br: Raiz do SDK
ru: Корень пакета SDK

# StringProperty|AppXLocation|DisplayName
source: App Package Location
pl: Lokalizacja pakietu aplikacji
pt_br: Local do Pacote do Aplicativo
ru: Расположение пакета приложения

# BoolProperty|CopyPayload|DisplayName
source: Copy Payload
pl: Kopiuj ładunek
pt_br: Copiar Conteúdo
ru: Копировать полезные данные

# StringProperty|CopyPayloadToSubDirectory|DisplayName
source: Copy Payload to Subdirectory
pl: Kopiuj ładunek do podkatalogu
pt_br: Copiar Conteúdo para o Subdiretório
ru: Копировать полезные данные в подкаталог

# BoolProperty|ExpandContent|DisplayName
source: Expand Content
pl: Rozwiń zawartość
pt_br: Expandir Conteúdo
ru: Расширить содержимое

# BoolProperty|ExpandReferenceAssemblies|DisplayName
source: Expand Reference Assemblies
pl: Rozwiń zestawy odwołań
pt_br: Expandir Assemblies de Referência
ru: Расширить эталонные сборки

# BoolProperty|CopyLocalExpandedReferenceAssemblies|DisplayName
source: Copy Local Expanded Reference Assemblies
pl: Kopiuj lokalne rozwinięte zestawy referencyjne
pt_br: Assemblies de Referência Expandidos do Local da Cópia
ru: Копировать локальные расширенные ссылочные сборки

# StringProperty|Name|DisplayName
source: Name
pl: Nazwa
pt_br: Nome
ru: Имя

# StringProperty|Version|DisplayName
source: Version
pl: Wersja
pt_br: Versão
ru: Версия
